000010   IDENTIFICATION DIVISION.
000020   PROGRAM-ID. COB1.
000030   DATA DIVISION.
000040   LINKAGE SECTION.
000050   01  LONG PIC S9(9) COMP-5.
000060   PROCEDURE DIVISION WITH STDCALL USING LONG.
000070             DISPLAY LONG.
000080             ADD 50 TO LONG.