000010   IDENTIFICATION DIVISION.
000020   PROGRAM-ID. COB2.
000030   DATA DIVISION.
000040   LINKAGE SECTION.
000050   01  CHAR PIC X(5).
000060   PROCEDURE DIVISION WITH STDCALL USING CHAR.
000070             DISPLAY CHAR.
000080             MOVE "FGHIJ" TO CHAR.