000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMO001".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-DEMO001 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--DEMO001.
000013     03 DEMO001 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  DEMO001 USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP1.
000013     03 GROUP1 PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  GROUP1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHS1.
000013     03 PUSHS1 PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  PUSHS1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHS2.
000013     03 PUSHS2 PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  PUSHS2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHW.
000013     03 PUSHW PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  PUSHW USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHT1.
000013     03 PUSHT1 PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  PUSHT1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHT2.
000013     03 PUSHT2 PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  PUSHT2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHSU.
000013     03 PUSHSU PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  PUSHSU USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL16.
000013     03 LABEL16 PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  LABEL16 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL15.
000013     03 LABEL15 PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  LABEL15 USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP2.
000013     03 GROUP2 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  GROUP2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ROOMTBL.
000013     03 ROOMTBL PIC S9(9) COMP-5.
000013     03 POW-P012 REDEFINES  ROOMTBL USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL2.
000013     03 LABEL2 PIC S9(9) COMP-5.
000013     03 POW-P013 REDEFINES  LABEL2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL3.
000013     03 LABEL3 PIC S9(9) COMP-5.
000013     03 POW-P014 REDEFINES  LABEL3 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL4.
000013     03 LABEL4 PIC S9(9) COMP-5.
000013     03 POW-P015 REDEFINES  LABEL4 USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP3.
000013     03 GROUP3 PIC S9(9) COMP-5.
000013     03 POW-P016 REDEFINES  GROUP3 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVLIST.
000013     03 RSVLIST PIC S9(9) COMP-5.
000013     03 POW-P017 REDEFINES  RSVLIST USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL11.
000013     03 LABEL11 PIC S9(9) COMP-5.
000013     03 POW-P018 REDEFINES  LABEL11 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL12.
000013     03 LABEL12 PIC S9(9) COMP-5.
000013     03 POW-P019 REDEFINES  LABEL12 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL13.
000013     03 LABEL13 PIC S9(9) COMP-5.
000013     03 POW-P020 REDEFINES  LABEL13 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL14.
000013     03 LABEL14 PIC S9(9) COMP-5.
000013     03 POW-P021 REDEFINES  LABEL14 USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHEND.
000013     03 PUSHEND PIC S9(9) COMP-5.
000013     03 POW-P022 REDEFINES  PUSHEND USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-DEMO001.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 22 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017******************************************************************
000018*        SHEET(ITEM) ===>    DEMO001
000019*        EVENT       ===>    WORKING
000020*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000021******************************************************************
000022*
000023*    GLOBAL AREA
000024*
000025 01  GL-AREA     IS  GLOBAL.
000026     03  WORK-AREA.
000027         05  WK-STRNG            PIC X(64).
000028*
000029*    EXTERNAL AREA
000030*
000031 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000032     03  RSV-INFORMATION.
000033         05  EX-RSVDATE      PIC X(10).
000034         05  EX-RSVNUM       PIC X(09).
000035         05  EX-RSVROOM      PIC X(04).
000036         05  EX-RSVTYPE      PIC X(02).
000037         05  EX-RSVNAME      PIC X(20).
000038         05  EX-RSVTEL       PIC X(12).
000039         05  EX-RSVSTAY      PIC X(02).
000040         05  EX-RSVTHIS      PIC X(09).
000041*
000042     03  MESSAGE-AREA.
000043         05  MSG-ERR         PIC X(80).
000044*
000045     03  SWITCH-AREA.
000046         05  RSV-SW          PIC X(02).
000047         05  SEL-SW          PIC 9(01).
000048*
000049     03  INDEX-AREA.
000050         05  DEL-IDX         PIC S9(04)  COMP-5.
000051         05  TBL-IDX         PIC S9(04)  COMP-5.
000052*
000053     03  ROOM-INFORMATION-LIST.
000054         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000055             07  ROOM-TYPE-CODE  PIC X(02).
000056             07  ROOM-TYPE-NAME  PIC X(16).
000057             07  ROOM-TOTAL-NUM  PIC 9(04).
000058             07  ROOM-RSV-NUM    PIC 9(04).
000059*
000060     03  RSV-DATE-LIST.
000061         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000062*
000063     03  RSV-NUM-LIST.
000064         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000065                                     INDEXED BY  RSVNO-IDX.
000066*
000067     03  RSV-ROOM-LIST.
000068         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000069                                     INDEXED BY  RSV-IDX.
000070*
000071     03  ROOM-LIST.
000072         04  ROOM-TYPE-LIST.
000073             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000074                 07  GUEST-ROOM          OCCURS  20  TIMES.
000075                     09  GUEST-ROOM-NUM  PIC X(04).
000076                     09  GUEST-ROOM-TYPE PIC X(02).
000077         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000078             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000079                 07  ROOM-NUM        PIC X(04).
000080                 07  ROOM-TYPE       PIC X(02).  
000081*
000082     03  NAME-LIST.
000083         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000084                                 INDEXED BY  NAME-IDX.
000085*
000086     03  TEL-LIST.
000087         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000088                                         INDEXED BY  TEL-IDX.
000089*
000090     03  STAY-LIST.
000091         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000092                                     INDEXED BY  CNT-IDX.
000093*
000094 CONSTANT SECTION.
000095 LINKAGE SECTION.
000096 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000097 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000098                    USAGE IS COMPUTATIONAL-5.
000099 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000100                    USAGE IS COMPUTATIONAL-5.
000101 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000102                    USAGE IS COMPUTATIONAL-5.
000103 PROCEDURE DIVISION
000104     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000105     EVALUATE POWER--MESSAGE
000106     WHEN 1025
000107         EVALUATE POWER--HPOWOBJ
000108         WHEN POWER--HPOWOBJ--RSVLIST
000109             EVALUATE POWER--NOTIFY
000110             WHEN 2 
000111                CALL "RSVLIST-DBLCLICK"
000112             END-EVALUATE
000113         WHEN POWER--HPOWOBJ--PUSHS1
000114             EVALUATE POWER--NOTIFY
000115             WHEN 1 
000116                CALL "PUSHS1-CLICK"
000117             END-EVALUATE
000118         WHEN POWER--HPOWOBJ--PUSHS2
000119             EVALUATE POWER--NOTIFY
000120             WHEN 1 
000121                CALL "PUSHS2-CLICK"
000122             END-EVALUATE
000123         WHEN POWER--HPOWOBJ--PUSHW
000124             EVALUATE POWER--NOTIFY
000125             WHEN 1 
000126                CALL "PUSHW-CLICK"
000127             END-EVALUATE
000128         WHEN POWER--HPOWOBJ--PUSHSU
000129             EVALUATE POWER--NOTIFY
000130             WHEN 1 
000131                CALL "PUSHSU-CLICK"
000132             END-EVALUATE
000133         WHEN POWER--HPOWOBJ--PUSHT1
000134             EVALUATE POWER--NOTIFY
000135             WHEN 1 
000136                CALL "PUSHT1-CLICK"
000137             END-EVALUATE
000138         WHEN POWER--HPOWOBJ--PUSHT2
000139             EVALUATE POWER--NOTIFY
000140             WHEN 1 
000141                CALL "PUSHT2-CLICK"
000142             END-EVALUATE
000143         WHEN POWER--HPOWOBJ--PUSHEND
000144             EVALUATE POWER--NOTIFY
000145             WHEN 1 
000146                CALL "PUSHEND-CLICK"
000147             END-EVALUATE
000148         END-EVALUATE
000149     WHEN 1024
000150         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000151     WHEN 1036
000152         CALL "DEMO001-OPENED"
000153     WHEN 1049
000154         CALL "DEMO001-CLOSECHILD"
000155     WHEN 1038
000156         CALL "DEMO001-START"
000157     END-EVALUATE
000158     EXIT PROGRAM.
000159 IDENTIFICATION DIVISION.
000160 PROGRAM-ID. "DEMO001-OPENED".
000161 ENVIRONMENT DIVISION.
000162 DATA        DIVISION.
000163 WORKING-STORAGE         SECTION.
000164*
000165 01  WORK-AREA.
000166     03  WK-TYPE             PIC X(2).
000167     03  WK-ROOMNO           PIC X(4).
000168     03  WK-ALL              PIC 9999.
000169     03  WK-RSV              PIC 9999.
000170     03  WK-COMP             PIC S9(8)V9(8).
000171     03  WK-RITU             PIC ZZ9.9.
000172     03  WK-RITU-D           PIC X(06).
000173     03  WK-YOYAKUDATE       PIC X(08).
000174     03  WK-YOYAKUNO         PIC X(09).
000175     03  WK-YOYAKURNO        PIC X(04).
000176     03  WK-ROOMTYPE         PIC X(02).
000177     03  WK-TBL-IDX          PIC S9(04)  COMP-5.
000177 77 POW-0001 PIC S9(14)V9(4) .
000177 77 POW-0002 PIC S9(4) COMP-5 .
000177 77 POW-0003 PIC S9(4) COMP-5 .
000177 77 POW-0004 PIC S9(14)V9(4) .
000177 77 POW-0005 PIC S9(4) COMP-5 .
000177 77 POW-0006 PIC S9(4) COMP-5 .
000177 77 POW-0007 PIC X(56) .
000177 77 POW-0008 PIC S9(4) COMP-5 .
000177 77 POW-0009 PIC S9(4) COMP-5 .
000177 77 POW-0010 PIC X(64) .
000178*
000179 PROCEDURE   DIVISION.
000180******************************************************************
000181 MAIN                    SECTION.
000182******************************************************************
000183*
000184*
000185***  RSV-INFORMATION TABLE EDIT  ***
000186*
000187     PERFORM TBLEDIT VARYING TBL-IDX FROM    1   BY  1
000188             UNTIL   TBL-IDX     >   7.
000189*
000190***  RSV-LIST EDIT   ***
000191*
000192     PERFORM LSTEDIT VARYING TBL-IDX FROM    1   BY  1
000193         UNTIL   TBL-IDX >   ROOM-RSV-NUM(7) OR  TBL-IDX >   100.
000194*
000195 MAIN-END.
000196     EXIT    PROGRAM.
000197*
000198******************************************************************
000199 TBLEDIT                 SECTION.
000200******************************************************************
000201*
000202     MOVE    ROOM-TOTAL-NUM(TBL-IDX) TO  WK-ALL.
000203     MOVE    ROOM-RSV-NUM(TBL-IDX)   TO  WK-RSV.
000204     PERFORM RITU-COMP.
000205     MOVE  WK-ALL  TO POW-0001.
000205     MOVE  TBL-IDX  TO POW-0002.
000205     MOVE  1  TO POW-0003.
000205     CALL   "XPOWTABLESETNUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0001  BY VALUE POW-0002 POW-0003 .
000206     MOVE  WK-RSV  TO POW-0004.
000206     MOVE  TBL-IDX  TO POW-0005.
000206     MOVE  2  TO POW-0006.
000206     CALL   "XPOWTABLESETNUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0004  BY VALUE POW-0005 POW-0006 .
000207     MOVE  WK-RITU-D  TO POW-0007.
000207     MOVE  TBL-IDX  TO POW-0008.
000207     MOVE  3  TO POW-0009.
000207     CALL   "XPOWTABLESETALPHANUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0007  BY VALUE POW-0008 POW-0009 .
000208*
000209 TBLEDIT-EX.
000210     EXIT.
000211*
000212******************************************************************
000213 RITU-COMP              SECTION.         *>  EDIT RESERVE %
000214******************************************************************
000215*
000216     COMPUTE WK-COMP ROUNDED = (ROOM-RSV-NUM (TBL-IDX) /
000217             ROOM-TOTAL-NUM(TBL-IDX))        *   100
000218         ON  SIZE    ERROR   MOVE ZERO   TO  WK-COMP
000219     END-COMPUTE.
000220     COMPUTE WK-RITU ROUNDED =   WK-COMP.
000221     STRING  WK-RITU "%" DELIMITED   BY  SIZE    INTO    WK-RITU-D
000222     END-STRING.
000223*
000224 RITU-END.
000225     EXIT.       
000226*
000227******************************************************************
000228 LSTEDIT                 SECTION.
000229******************************************************************
000230*
000231     PERFORM TYPE-SRH.
000232     STRING  " "
000233             RSV-DATE (TBL-IDX)  
000234             "     "
000235             RSV-NUM (TBL-IDX)
000236             "       "
000237             RSV-ROOM (TBL-IDX)
000238             "        "
000239             WK-TYPE     
000240             "   "
000241             DELIMITED   BY SIZE
000242             INTO    WK-STRNG
000243     END-STRING.
000244     MOVE  WK-STRNG  TO POW-0010
000244     CALL    "XPOWLISTADDSTRING"  USING BY VALUE RSVLIST BY REFERENCE POW-0010 .
000245*
000246 LSTEDIT-EX.
000247     EXIT.
000248*
000249******************************************************************
000250 TYPE-SRH                SECTION.        *>  INDEX ROOM TYPE
000251******************************************************************
000252*
000253*
000254     SET     ROOM-IDX    TO  1.
000255     SEARCH  ROOM-TABLE
000256         AT  END MOVE    SPACE       TO  WK-TYPE
000257         WHEN    RSV-ROOM (TBL-IDX)  =   ROOM-NUM (ROOM-IDX)
000258             MOVE    ROOM-TYPE (ROOM-IDX)    TO  WK-TYPE
000259     END-SEARCH. 
000260 TYPE-END.
000261     EXIT.
000262*
000263 END PROGRAM "DEMO001-OPENED".
000264 IDENTIFICATION DIVISION.
000265 PROGRAM-ID. "DEMO001-CLOSECHILD".
000266 ENVIRONMENT DIVISION.
000267 DATA        DIVISION.
000268 WORKING-STORAGE SECTION.
000269 01  WORK-AREA.
000270     03  WK-ALL                  PIC 9999.
000271     03  WK-RSV                  PIC 9999.
000272     03  WK-COMP                 PIC S9(8)V9(8).
000273     03  WK-RITU                 PIC ZZ9.9.
000274     03  WK-RITU-D               PIC X(06).
000275     03  WK-POSITION             PIC 9(10)   VALUE   0.
000276     03  SV-IDX                  PIC 9(10)   VALUE   0.
000277     03  WK-TYPE                 PIC X(02).
000278     03  WK-IDX                  PIC S9(04)  COMP-5.
000278 77 POW-0001 PIC S9(4) COMP-5 .
000278 77 POW-0002 PIC S9(4) COMP-5 .
000278 77 POW-0003 PIC S9(14)V9(4) .
000278 77 POW-0004 PIC S9(4) COMP-5 .
000278 77 POW-0005 PIC S9(4) COMP-5 .
000278 77 POW-0006 PIC S9(14)V9(4) .
000278 77 POW-0007 PIC S9(4) COMP-5 .
000278 77 POW-0008 PIC S9(4) COMP-5 .
000278 77 POW-0009 PIC X(56) .
000278 77 POW-0010 PIC S9(4) COMP-5 .
000278 77 POW-0011 PIC S9(4) COMP-5 .
000278 77 POW-0012 PIC S9(4) COMP-5 .
000278 77 POW-0013 PIC X(64) .
000278 77 POW-0014 PIC S9(4) COMP-5 .
000279*
000280 PROCEDURE   DIVISION.
000281******************************************************************
000282 MAIN                    SECTION.
000283******************************************************************
000284*
000285***  EDIT RESERVE INFOMATION ***
000286*
000287     PERFORM TBLEDIT VARYING TBL-IDX FROM    1   BY  1
000288             UNTIL   TBL-IDX     >   7.
000289*
000290***  CHECK DATA  &   EDIT RESERVE LIST
000291     IF  RSV-SW  =   "ON"
000292         PERFORM RSVLIST-REDISP
000293         MOVE  0  TO POW-0001
000293         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE RSVLIST POW-0001 
000294         MOVE  1  TO POW-0002
000294         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE RSVLIST POW-0002 
000295     END-IF.
000296     MOVE    "OF"            TO  RSV-SW.
000297*
000298 MAIN-END.
000299     EXIT    PROGRAM.
000300*
000301******************************************************************
000302 TBLEDIT                 SECTION.
000303******************************************************************
000304*
000305     MOVE    ROOM-TOTAL-NUM(TBL-IDX) TO  WK-ALL.
000306     MOVE    ROOM-RSV-NUM(TBL-IDX)   TO  WK-RSV.
000307     PERFORM RITU-COMP.
000308     MOVE  WK-ALL  TO POW-0003
000308     MOVE  TBL-IDX  TO POW-0004
000308     MOVE  1  TO POW-0005
000308     CALL   "XPOWTABLESETNUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0003  BY VALUE POW-0004 POW-0005 .
000309     MOVE  WK-RSV  TO POW-0006
000309     MOVE  TBL-IDX  TO POW-0007
000309     MOVE  2  TO POW-0008
000309     CALL   "XPOWTABLESETNUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0006  BY VALUE POW-0007 POW-0008 .
000310     MOVE  WK-RITU-D  TO POW-0009
000310     MOVE  TBL-IDX  TO POW-0010
000310     MOVE  3  TO POW-0011
000310     CALL   "XPOWTABLESETALPHANUMERICTO"  USING BY VALUE ROOMTBL BY REFERENCE POW-0009  BY VALUE POW-0010 POW-0011 .
000311*
000312 TBLEDIT-EX.
000313     EXIT.
000314*
000315******************************************************************
000316 RITU-COMP               SECTION.
000317******************************************************************
000318*
000319     COMPUTE WK-COMP ROUNDED = (ROOM-RSV-NUM (TBL-IDX) /
000320             ROOM-TOTAL-NUM(TBL-IDX))        *   100
000321         ON  SIZE    ERROR   MOVE ZERO   TO  WK-COMP
000322     END-COMPUTE.
000323     COMPUTE WK-RITU ROUNDED =   WK-COMP.
000324     STRING  WK-RITU "%" DELIMITED   BY  SIZE
000325             INTO    WK-RITU-D
000326     END-STRING.
000327 RITU-END.
000328     EXIT.       
000329*
000330******************************************************************
000331 RSVLIST-REDISP          SECTION.
000332******************************************************************
000333*
000334***  DELETE RESERVE LIST ***
000335*
000336     COMPUTE WK-IDX  =   ROOM-RSV-NUM(7) -   1.
000337     PERFORM VARYING     DEL-IDX FROM    WK-IDX  BY  -1
000338         UNTIL   DEL-IDX <   0
000339         MOVE  DEL-IDX  TO POW-0012
000339         CALL    "XPOWLISTDELSTRING"  USING BY VALUE RSVLIST POW-0012 
000340     END-PERFORM.
000341*
000342***  EDIT RESERVE LIST   ***
000343*
000344     PERFORM VARYING TBL-IDX FROM    1   BY  1
000345         UNTIL       TBL-IDX >   ROOM-RSV-NUM(7) OR
000346                     TBL-IDX >   100
000347         PERFORM RS-STRING-EDT
000348         MOVE  WK-STRNG  TO POW-0013
000348         CALL    "XPOWLISTADDSTRING"  USING BY VALUE RSVLIST BY REFERENCE POW-0013 
000349     END-PERFORM.
000350     MOVE  ROOM-RSV-NUM ( 7 )  TO POW-0014
000350     CALL  "XPOWLISTSETSELECT"  USING BY VALUE RSVLIST POW-0014 .
000351*
000352 RSVLIST-REDISP-EX.
000353     EXIT.
000354*
000355******************************************************************
000356 RS-STRING-EDT           SECTION.
000357******************************************************************
000358*
000359     PERFORM TYPE-SRH
000360     MOVE    SPACE           TO  WK-STRNG.
000361     STRING  " "
000362             RSV-DATE (TBL-IDX)  
000363             "   "
000364             RSV-NUM (TBL-IDX)
000365             "    "
000366             RSV-ROOM (TBL-IDX)
000367             "   "
000368             WK-TYPE     
000369             "  "
000370             DELIMITED   BY SIZE
000371             INTO    WK-STRNG
000372     END-STRING.     
000373 RS-STRING-END.
000374     EXIT.
000375*
000376******************************************************************
000377 TYPE-SRH                SECTION.        *>  SEARCH ROOM TYPE
000378******************************************************************
000379*
000380     SET     ROOM-IDX    TO  1.
000381     SEARCH  ROOM-TABLE
000382         AT  END MOVE    SPACE       TO  WK-TYPE
000383         WHEN    RSV-ROOM (TBL-IDX)  =   ROOM-NUM(ROOM-IDX)
000384             MOVE    ROOM-TYPE(ROOM-IDX) TO  WK-TYPE
000385     END-SEARCH.
000386*
000387 TYPE-END.
000388     EXIT.
000389 END PROGRAM "DEMO001-CLOSECHILD".
000390 IDENTIFICATION DIVISION.
000391 PROGRAM-ID. "DEMO001-START".
000392 PROCEDURE DIVISION.
000393     EXIT PROGRAM.
000394 END PROGRAM "DEMO001-START".
000395 IDENTIFICATION DIVISION.
000396 PROGRAM-ID. "RSVLIST-DBLCLICK".
000397 ENVIRONMENT DIVISION.
000398 DATA        DIVISION.
000399 WORKING-STORAGE SECTION.
000400 01  UN-DATA-AREA.
000401     03  UN-DATA             PIC X(20)   OCCURS  15.
000401 77 POW-0001 PIC X(14) .
000401 77 POW-0002 PIC X(64) .
000402 PROCEDURE   DIVISION.
000403******************************************************************
000404 MAIN                    SECTION.
000405******************************************************************
000406*
000407     PERFORM SELUNSTRNG.
000408*
000409     PERFORM NEXT-EDT.
000410*
000411     MOVE  "DEMO101"  TO POW-0001.
000411     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000412     IF  RETURN-CODE NOT =   0
000413         CONTINUE
000414     END-IF.
000415*
000416 MAIN-EX.
000417     EXIT    PROGRAM.
000418*
000419******************************************************************
000420 SELUNSTRNG  SECTION.
000421******************************************************************
000422     CALL  "XPOWLISTGETSELSTRING"  USING BY VALUE RSVLIST  BY REFERENCE POW-0002 
000422     MOVE    POW-0002    TO  WK-STRNG.
000423     MOVE    SPACE           TO  UN-DATA-AREA.
000424     UNSTRING    WK-STRNG
000425         DELIMITED   BY  ALL SPACE
000426         INTO    UN-DATA(1)  UN-DATA(2)  UN-DATA(3)  UN-DATA(4)
000427                 UN-DATA(5)  UN-DATA(6)  UN-DATA(7)  UN-DATA(8)
000428                 UN-DATA(9)  UN-DATA(10) UN-DATA(11) UN-DATA(12)
000429                 UN-DATA(13) UN-DATA(14) UN-DATA(15)
000430     END-UNSTRING.
000431     MOVE    UN-DATA(2)      TO  EX-RSVDATE.
000432     MOVE    UN-DATA(3)      TO  EX-RSVNUM.
000433     MOVE    UN-DATA(4)      TO  EX-RSVROOM.
000434     MOVE    UN-DATA(5)      TO  EX-RSVTYPE.
000435*
000436 SELUNSTRNG-EX.
000437     EXIT.
000438*
000439******************************************************************
000440 NEXT-EDT                SECTION.        *>  EDIT EXTERNAL AREA
000441******************************************************************
000442*
000443     SET RSVNO-IDX TO 1
000444     PERFORM VARYING TBL-IDX FROM    1   BY  1
000445         UNTIL   TBL-IDX >   100 OR
000446                 RSV-NUM(RSVNO-IDX)  =   SPACE
000447         IF  RSV-NUM(TBL-IDX)    =   EX-RSVNUM
000448             MOVE    GUEST-NAME(TBL-IDX)     TO  EX-RSVNAME
000449             MOVE    TEL-NUM(TBL-IDX)    TO  EX-RSVTEL
000450             MOVE    STAY-NUM(TBL-IDX)   TO  EX-RSVSTAY
000451             EXIT    PERFORM
000452         END-IF
000453     END-PERFORM.
000454     IF  TBL-IDX >   100 OR  RSV-NUM(RSVNO-IDX)  =   SPACE
000455         MOVE    SPACE       TO  EX-RSVNAME
000456         MOVE    SPACE       TO  EX-RSVTEL
000457         MOVE    SPACE       TO  EX-RSVSTAY  
000458     END-IF.
000459*
000460 NEXT-END.
000461     EXIT.
000462
000463 END PROGRAM "RSVLIST-DBLCLICK".
000464 IDENTIFICATION DIVISION.
000465 PROGRAM-ID. "PUSHS1-CLICK".
000466 ENVIRONMENT DIVISION.
000467 DATA        DIVISION.
000468 WORKING-STORAGE         SECTION.
000469 01  WORK-AREA.
000470     03  WK-YOYAKUNO.
000471         05  WK-Y-MM         PIC 9(02).
000472         05  WK-Y-DD         PIC 9(02).
000473         05  WK-P            PIC X(01)   VALUE   "-".
000474         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000475     03  WK-YMD.
000476         05  WK-YY           PIC X(04).
000477         05  FILLER          PIC X(01).
000478         05  WK-MM           PIC X(02).
000479         05  FILLER          PIC X(01).
000480         05  WK-DD           PIC X(02).
000480 77 POW-0001 PIC X(14) .
000481*
000482 PROCEDURE   DIVISION.
000483******************************************************************
000484 MAIN                    SECTION.
000485******************************************************************
000486*
000487***  EDIT SWITCH INFOMATION BY TYPE  ***
000488     MOVE    1               TO  SEL-SW.
000489     MOVE    "S1"            TO  EX-RSVTYPE.
000490*
000491***  CLEAR RESERVE SWITCH    ***
000492     MOVE    "OF"            TO  RSV-SW.
000493*
000494     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000495*
000496*    MAKE RESERVE NUMBER ***
000497     MOVE    EX-RSVDATE  TO  WK-YMD.
000498     MOVE    WK-MM           TO  WK-Y-MM.
000499     MOVE    WK-DD           TO  WK-Y-DD.
000500     MOVE    ROOM-RSV-NUM(7)     TO  WK-NUMBER.
000501     ADD     1               TO  WK-NUMBER.
000502     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000503*
000504     MOVE  "DEMO201"  TO POW-0001.
000504     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000505     IF  RETURN-CODE <   0
000506         THEN
000507             CONTINUE
000508     END-IF.
000509*
000510 MAIN-EX.
000511     EXIT    PROGRAM.
000512     
000513 END PROGRAM "PUSHS1-CLICK".
000514 IDENTIFICATION DIVISION.
000515 PROGRAM-ID. "PUSHS2-CLICK".
000516 ENVIRONMENT DIVISION.
000517 DATA        DIVISION.
000518 WORKING-STORAGE         SECTION.
000519 01  WORK-AREA.
000520     03  WK-YOYAKUNO.
000521         05  WK-Y-MM         PIC 9(02).
000522         05  WK-Y-DD         PIC 9(02).
000523         05  WK-P            PIC X(01)   VALUE   "-".
000524         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000525     03  WK-YMD.
000526         05  WK-YY           PIC X(04).
000527         05  FILLER          PIC X(01).
000528         05  WK-MM           PIC X(02).
000529         05  FILLER          PIC X(01).
000530         05  WK-DD           PIC X(02).
000530 77 POW-0001 PIC X(14) .
000531*
000532 PROCEDURE   DIVISION.
000533******************************************************************
000534 MAIN                    SECTION.
000535******************************************************************
000536*
000537     MOVE    2               TO  SEL-SW.
000538     MOVE    "S2"            TO  EX-RSVTYPE.
000539*
000540     MOVE    "OF"            TO  RSV-SW.
000541*
000542     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000543*
000544     MOVE    EX-RSVDATE      TO  WK-YMD.
000545     MOVE    WK-MM           TO  WK-Y-MM.
000546     MOVE    WK-DD           TO  WK-Y-DD.
000547     MOVE    ROOM-RSV-NUM(7)     TO  WK-NUMBER.
000548     ADD     1               TO  WK-NUMBER.
000549     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000550*
000551     MOVE  "DEMO201"  TO POW-0001.
000551     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000552     IF  RETURN-CODE <   0
000553         THEN
000554             CONTINUE
000555     END-IF.
000556*
000557 MAIN-EX.
000558     EXIT    PROGRAM.
000559     
000560 END PROGRAM "PUSHS2-CLICK".
000561 IDENTIFICATION DIVISION.
000562 PROGRAM-ID. "PUSHW-CLICK".
000563 ENVIRONMENT DIVISION.
000564 DATA        DIVISION.
000565 WORKING-STORAGE         SECTION.
000566 01  WORK-AREA.
000567     03  WK-YOYAKUNO.
000568         05  WK-Y-MM         PIC 9(02).
000569         05  WK-Y-DD         PIC 9(02).
000570         05  WK-P            PIC X(01)   VALUE   "-".
000571         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000572     03  WK-YMD.
000573         05  WK-YY           PIC X(04).
000574         05  FILLER          PIC X(01).
000575         05  WK-MM           PIC X(02).
000576         05  FILLER          PIC X(01).
000577         05  WK-DD           PIC X(02).
000577 77 POW-0001 PIC X(14) .
000578*
000579 PROCEDURE   DIVISION.
000580******************************************************************
000581 MAIN                    SECTION.
000582******************************************************************
000583*
000584     MOVE    3               TO  SEL-SW.
000585     MOVE    "W"             TO  EX-RSVTYPE.
000586*
000587     MOVE    "OF"            TO  RSV-SW.
000588*
000589     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000590*
000591     MOVE    EX-RSVDATE      TO  WK-YMD.
000592     MOVE    WK-MM           TO  WK-Y-MM.
000593     MOVE    WK-DD           TO  WK-Y-DD.
000594     MOVE    ROOM-RSV-NUM(7) TO  WK-NUMBER.
000595     ADD     1               TO  WK-NUMBER.
000596     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000597*
000598     MOVE  "DEMO201"  TO POW-0001.
000598     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000599     IF  RETURN-CODE <   0
000600         THEN
000601             CONTINUE
000602     END-IF.
000603*
000604 MAIN-EX.
000605     EXIT    PROGRAM.
000606     
000607 END PROGRAM "PUSHW-CLICK".
000608 IDENTIFICATION DIVISION.
000609 PROGRAM-ID. "PUSHSU-CLICK".
000610 ENVIRONMENT DIVISION.
000611 DATA        DIVISION.
000612 WORKING-STORAGE         SECTION.
000613 01  WORK-AREA.
000614     03  WK-YOYAKUNO.
000615         05  WK-Y-MM         PIC 9(02).
000616         05  WK-Y-DD         PIC 9(02).
000617         05  WK-P            PIC X(01)   VALUE   "-".
000618         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000619     03  WK-YMD.
000620         05  WK-YY           PIC X(04).
000621         05  FILLER          PIC X(01).
000622         05  WK-MM           PIC X(02).
000623         05  FILLER          PIC X(01).
000624         05  WK-DD           PIC X(02).
000624 77 POW-0001 PIC X(14) .
000625*
000626 PROCEDURE   DIVISION.
000627******************************************************************
000628 MAIN                    SECTION.
000629******************************************************************
000630*
000631     MOVE    6               TO  SEL-SW.
000632     MOVE    "SU"            TO  EX-RSVTYPE.
000633*
000634     MOVE    "OF"            TO  RSV-SW.
000635     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000636     MOVE    EX-RSVDATE      TO  WK-YMD.
000637     MOVE    WK-MM           TO  WK-Y-MM.
000638     MOVE    WK-DD           TO  WK-Y-DD.
000639     MOVE    ROOM-RSV-NUM(7) TO  WK-NUMBER.
000640     ADD     1               TO  WK-NUMBER.
000641     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000642*
000643     MOVE  "DEMO201"  TO POW-0001.
000643     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000644     IF  RETURN-CODE <   0
000645         THEN
000646             CONTINUE
000647     END-IF.
000648*
000649 MAIN-EX.
000650     EXIT    PROGRAM.
000651     
000652 END PROGRAM "PUSHSU-CLICK".
000653 IDENTIFICATION DIVISION.
000654 PROGRAM-ID. "PUSHT1-CLICK".
000655 ENVIRONMENT DIVISION.
000656 DATA        DIVISION.
000657 WORKING-STORAGE         SECTION.
000658 01  WORK-AREA.
000659     03  WK-YOYAKUNO.
000660         05  WK-Y-MM         PIC 9(02).
000661         05  WK-Y-DD         PIC 9(02).
000662         05  WK-P            PIC X(01)   VALUE   "-".
000663         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000664     03  WK-YMD.
000665         05  WK-YY           PIC X(04).
000666         05  FILLER          PIC X(01).
000667         05  WK-MM           PIC X(02).
000668         05  FILLER          PIC X(01).
000669         05  WK-DD           PIC X(02).
000669 77 POW-0001 PIC X(14) .
000670*
000671 PROCEDURE   DIVISION.
000672******************************************************************
000673 MAIN                    SECTION.
000674******************************************************************
000675*
000676     MOVE    4               TO  SEL-SW.
000677     MOVE    "T1"            TO  EX-RSVTYPE.
000678*
000679     MOVE    "OF"            TO  RSV-SW.
000680*
000681     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000682*
000683     MOVE    EX-RSVDATE  TO  WK-YMD.
000684     MOVE    WK-MM           TO  WK-Y-MM.
000685     MOVE    WK-DD           TO  WK-Y-DD.
000686     MOVE    ROOM-RSV-NUM(7) TO  WK-NUMBER.
000687     ADD     1               TO  WK-NUMBER.
000688     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000689*
000690     MOVE  "DEMO201"  TO POW-0001.
000690     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000691     IF  RETURN-CODE <   0
000692         THEN
000693             CONTINUE
000694     END-IF.
000695*
000696 MAIN-EX.
000697     EXIT    PROGRAM.
000698     
000699 END PROGRAM "PUSHT1-CLICK".
000700 IDENTIFICATION DIVISION.
000701 PROGRAM-ID. "PUSHT2-CLICK".
000702 ENVIRONMENT DIVISION.
000703 DATA        DIVISION.
000704 WORKING-STORAGE         SECTION.
000705 01  WORK-AREA.
000706     03  WK-YOYAKUNO.
000707         05  WK-Y-MM         PIC 9(02).
000708         05  WK-Y-DD         PIC 9(02).
000709         05  WK-P            PIC X(01)   VALUE   "-".
000710         05  WK-NUMBER       PIC 9(04)   VALUE   ZERO.
000711     03  WK-YMD.
000712         05  WK-YY           PIC X(04).
000713         05  FILLER          PIC X(01).
000714         05  WK-MM           PIC X(02).
000715         05  FILLER          PIC X(01).
000716         05  WK-DD           PIC X(02).
000716 77 POW-0001 PIC X(14) .
000717*
000718 PROCEDURE   DIVISION.
000719******************************************************************
000720 MAIN                    SECTION.
000721******************************************************************
000722*
000723     MOVE    5               TO  SEL-SW.
000724     MOVE    "T2"            TO  EX-RSVTYPE.
000725*
000726     MOVE    "OF"            TO  RSV-SW.
000727*
000728     MOVE    RSV-DATE(1)     TO  EX-RSVDATE.
000729*
000730     MOVE    EX-RSVDATE      TO  WK-YMD.
000731     MOVE    WK-MM           TO  WK-Y-MM.
000732     MOVE    WK-DD           TO  WK-Y-DD.
000733     MOVE    ROOM-RSV-NUM(7) TO  WK-NUMBER.
000734     ADD     1               TO  WK-NUMBER.
000735     MOVE    WK-YOYAKUNO     TO  EX-RSVTHIS.
000736*
000737     MOVE  "DEMO201"  TO POW-0001.
000737     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000738     IF  RETURN-CODE <   0
000739         THEN
000740             CONTINUE
000741     END-IF.
000742*
000743 MAIN-EX.
000744     EXIT    PROGRAM.
000745     
000746 END PROGRAM "PUSHT2-CLICK".
000747 IDENTIFICATION DIVISION.
000748 PROGRAM-ID. "PUSHEND-CLICK".
000749 ENVIRONMENT DIVISION.
000750 DATA        DIVISION.
000750 WORKING-STORAGE SECTION.
000750 77 POW-0001 PIC X(14) .
000751 PROCEDURE   DIVISION.
000752******************************************************************
000753 MAIN                    SECTION.
000754******************************************************************
000755*
000756     MOVE  "DEMO001"  TO POW-0001.
000756     CALL    "XPOWCSCLOSESHEET"  USING BY VALUE DEMO001 BY REFERENCE POW-0001 .
000757*
000758 MAIN-EX.
000759     EXIT    PROGRAM.
000760 END PROGRAM "PUSHEND-CLICK".
000761 END PROGRAM "DEMO001".
