000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMO201".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-DEMO201 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--DEMO201.
000013     03 DEMO201 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  DEMO201 USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP3.
000013     03 GROUP3 PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  GROUP3 USAGE POINTER.
000013   02 POWER--HPOWOBJ--NORSVLIST.
000013     03 NORSVLIST PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  NORSVLIST USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP2.
000013     03 GROUP2 PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  GROUP2 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVDATE211.
000013     03 LRSVDATE211 PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  LRSVDATE211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LROOMTYP211.
000013     03 LROOMTYP211 PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  LROOMTYP211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LROOMNO211.
000013     03 LROOMNO211 PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  LROOMNO211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVNO211.
000013     03 LRSVNO211 PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  LRSVNO211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVDATE211.
000013     03 RSVDATE211 PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  RSVDATE211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ROOMTYP211.
000013     03 ROOMTYP211 PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  ROOMTYP211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ROOMNO211.
000013     03 ROOMNO211 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  ROOMNO211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVNO211.
000013     03 RSVNO211 PIC S9(9) COMP-5.
000013     03 POW-P012 REDEFINES  RSVNO211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--GROUP1.
000013     03 GROUP1 PIC S9(9) COMP-5.
000013     03 POW-P013 REDEFINES  GROUP1 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LCSTNAME211.
000013     03 LCSTNAME211 PIC S9(9) COMP-5.
000013     03 POW-P014 REDEFINES  LCSTNAME211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LCSTTEL211.
000013     03 LCSTTEL211 PIC S9(9) COMP-5.
000013     03 POW-P015 REDEFINES  LCSTTEL211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVCNT211.
000013     03 LRSVCNT211 PIC S9(9) COMP-5.
000013     03 POW-P016 REDEFINES  LRSVCNT211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CSTNAME211.
000013     03 CSTNAME211 PIC S9(9) COMP-5.
000013     03 POW-P017 REDEFINES  CSTNAME211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CSTTEL211.
000013     03 CSTTEL211 PIC S9(9) COMP-5.
000013     03 POW-P018 REDEFINES  CSTTEL211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVCNT211.
000013     03 RSVCNT211 PIC S9(9) COMP-5.
000013     03 POW-P019 REDEFINES  RSVCNT211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CLOSE211.
000013     03 CLOSE211 PIC S9(9) COMP-5.
000013     03 POW-P020 REDEFINES  CLOSE211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CANCEL211.
000013     03 CANCEL211 PIC S9(9) COMP-5.
000013     03 POW-P021 REDEFINES  CANCEL211 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL28.
000013     03 LABEL28 PIC S9(9) COMP-5.
000013     03 POW-P022 REDEFINES  LABEL28 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL29.
000013     03 LABEL29 PIC S9(9) COMP-5.
000013     03 POW-P023 REDEFINES  LABEL29 USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-DEMO201.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 23 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017******************************************************************
000018*        SHEET(ITEM) ===>    DEMO201
000019*        EVENT       ===>    WORKING
000020*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000021******************************************************************
000022*
000023*01  GL-AREA     IS  GLOBAL.
000024*
000025 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000026     03  RSV-INFORMATION.
000027         05  EX-RSVDATE      PIC X(10).
000028         05  EX-RSVNUM       PIC X(09).
000029         05  EX-RSVROOM      PIC X(04).
000030         05  EX-RSVTYPE      PIC X(02).
000031         05  EX-RSVNAME      PIC X(20).
000032         05  EX-RSVTEL       PIC X(12).
000033         05  EX-RSVSTAY      PIC X(02).
000034         05  EX-RSVTHIS      PIC X(09).
000035*
000036     03  MESSAGE-AREA.
000037         05  MSG-ERR         PIC X(80).
000038*
000039     03  SWITCH-AREA.
000040         05  RSV-SW          PIC X(02).
000041         05  SEL-SW          PIC 9(01).
000042*
000043     03  INDEX-AREA.
000044         05  DEL-IDX         PIC S9(04)  COMP-5.
000045         05  TBL-IDX         PIC S9(04)  COMP-5.
000046*
000047     03  ROOM-INFORMATION-LIST.
000048         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000049             07  ROOM-TYPE-CODE  PIC X(02).
000050             07  ROOM-TYPE-NAME  PIC X(16).
000051             07  ROOM-TOTAL-NUM  PIC 9(04).
000052             07  ROOM-RSV-NUM    PIC 9(04).
000053*
000054     03  RSV-DATE-LIST.
000055         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000056*
000057     03  RSV-NUM-LIST.
000058         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000059                                     INDEXED BY  RSVNO-IDX.
000060*
000061     03  RSV-ROOM-LIST.
000062         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000063                                     INDEXED BY  RSV-IDX.
000064*
000065     03  ROOM-LIST.
000066         04  ROOM-TYPE-LIST.
000067             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000068                 07  GUEST-ROOM          OCCURS  20  TIMES.
000069                     09  GUEST-ROOM-NUM  PIC X(04).
000070                     09  GUEST-ROOM-TYPE PIC X(02).
000071         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000072             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000073                 07  ROOM-NUM        PIC X(04).
000074                 07  ROOM-TYPE       PIC X(02).  
000075*
000076     03  NAME-LIST.
000077         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000078                                 INDEXED BY  NAME-IDX.
000079*
000080     03  TEL-LIST.
000081         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000082                                         INDEXED BY  TEL-IDX.
000083*
000084     03  STAY-LIST.
000085         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000086                                     INDEXED BY  CNT-IDX.
000087*
000088 CONSTANT SECTION.
000089 LINKAGE SECTION.
000090 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000091 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000092                    USAGE IS COMPUTATIONAL-5.
000093 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000094                    USAGE IS COMPUTATIONAL-5.
000095 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000096                    USAGE IS COMPUTATIONAL-5.
000097 PROCEDURE DIVISION
000098     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000099     EVALUATE POWER--MESSAGE
000100     WHEN 1025
000101         EVALUATE POWER--HPOWOBJ
000102         WHEN POWER--HPOWOBJ--CLOSE211
000103             EVALUATE POWER--NOTIFY
000104             WHEN 1 
000105                CALL "CLOSE211-CLICK"
000106             END-EVALUATE
000107         WHEN POWER--HPOWOBJ--CANCEL211
000108             EVALUATE POWER--NOTIFY
000109             WHEN 1 
000110                CALL "CANCEL211-CLICK"
000111             END-EVALUATE
000112         WHEN POWER--HPOWOBJ--NORSVLIST
000113             EVALUATE POWER--NOTIFY
000114             WHEN 2 
000115                CALL "NORSVLIST-DBLCLICK"
000116             END-EVALUATE
000117         END-EVALUATE
000118     WHEN 1024
000119         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000120     WHEN 1036
000121         CALL "DEMO201-OPENED"
000122     WHEN 1038
000123         CALL "DEMO201-START"
000124     END-EVALUATE
000125     EXIT PROGRAM.
000126 IDENTIFICATION DIVISION.
000127 PROGRAM-ID. "DEMO201-OPENED".
000128 ENVIRONMENT DIVISION.
000129 DATA        DIVISION.
000130 WORKING-STORAGE         SECTION.
000131*
000132***  シート内ワークエリア    ***
000133*
000134 01  WORK-AREA.
000135     03  WK-TYPE             PIC X(02).
000136     03  WK-IDX1             PIC S9(08)  COMP-5  VALUE   0.
000137     03  WK-IDX2             PIC S9(08)  COMP-5  VALUE   0.
000138     03  WK-STRNG            PIC X(64).
000138 77 POW-0001 PIC X(256) .
000138 77 POW-0002 PIC X(256) .
000138 77 POW-0003 PIC X(256) .
000138 77 POW-0004 PIC X(64) .
000139*
000140 PROCEDURE   DIVISION.
000141******************************************************************
000142 MAIN                    SECTION.
000143******************************************************************
000144*
000145     MOVE  EX-RSVDATE  TO POW-0001.
000145     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVDATE211  BY REFERENCE POW-0001 .
000146     MOVE  EX-RSVTYPE  TO POW-0002.
000146     CALL  "XPOWCWSETTEXT"  USING BY VALUE ROOMTYP211  BY REFERENCE POW-0002 . 
000147     MOVE    EX-RSVTYPE  TO  WK-TYPE.
000148     MOVE  EX-RSVNUM  TO POW-0003.
000148     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVNO211  BY REFERENCE POW-0003 .
000149     MOVE    SEL-SW      TO  WK-IDX1.
000150*
000151***  EDIT VACANT INFORMATION ***
000152     PERFORM ROOM-SRH
000153         VARYING WK-IDX2 FROM    1   BY  1
000154         UNTIL   WK-IDX2 >   20  OR
000155                 GUEST-ROOM-NUM(WK-IDX1 WK-IDX2) =   SPACE.
000156*
000157 MAIN-END.
000158     EXIT    PROGRAM.
000159*
000160******************************************************************
000161 ROOM-SRH            SECTION.        *>  SEARCH VACANT 
000162******************************************************************
000163*
000164     SET     RSV-IDX     TO  1.
000165     SEARCH  RSV-ROOM
000166         AT  END
000167             PERFORM COMB-EDT
000168         WHEN    RSV-ROOM(RSV-IDX)   =
000169                 GUEST-ROOM-NUM(WK-IDX1 WK-IDX2)
000170             CONTINUE
000171     END-SEARCH.
000172*
000173 ROOM-EX.
000174     EXIT.
000175******************************************************************
000176 COMB-EDT                SECTION.
000177******************************************************************
000178*
000179     STRING  "  "
000180             GUEST-ROOM-NUM(WK-IDX1 WK-IDX2)
000181             "           "
000182             GUEST-ROOM-TYPE(WK-IDX1 WK-IDX2)
000183             " "
000184             DELIMITED   BY SIZE
000185             INTO    WK-STRNG
000186     END-STRING.         
000187     MOVE  WK-STRNG  TO POW-0004
000187     CALL    "XPOWLISTADDSTRING"  USING BY VALUE NORSVLIST BY REFERENCE POW-0004 .
000188*
000189 COMB-EX.
000190     EXIT.       
000191 END PROGRAM "DEMO201-OPENED".
000192 IDENTIFICATION DIVISION.
000193 PROGRAM-ID. "DEMO201-START".
000194 PROCEDURE DIVISION.
000195     EXIT PROGRAM.
000196 END PROGRAM "DEMO201-START".
000197 IDENTIFICATION DIVISION.
000198 PROGRAM-ID. "CLOSE211-CLICK".
000199 ENVIRONMENT DIVISION.
000200 DATA        DIVISION.
000200 WORKING-STORAGE SECTION.
000200 77 POW-0001 PIC X(14) .
000200 77 POW-0002 PIC X(256) .
000200 77 POW-0003 PIC X(256) .
000200 77 POW-0004 PIC X(256) .
000200 77 POW-0005 PIC X(256) .
000200 77 POW-0006 PIC X(256) .
000200 77 POW-0007 PIC X(14) .
000200 77 POW-0008 PIC X(256) .
000200 77 POW-0009 PIC X(256) .
000200 77 POW-0010 PIC X(256) .
000200 77 POW-0011 PIC X(256) .
000201 PROCEDURE   DIVISION.
000202******************************************************************
000203 MAIN                    SECTION.
000204******************************************************************
000205*
000206     PERFORM INDTSAVE.
000207*
000208***  ERROR CHECK     *** 
000209     IF  EX-RSVROOM      =   SPACE
000210         MOVE    "Select room number."   TO  MSG-ERR
000211         PERFORM ERRMSG-SEC
000212         GO  TO  MAIN-EX
000213     END-IF.
000214     IF  EX-RSVSTAY      =   SPACE   OR
000215         EX-RSVNAME      =   SPACE   OR
000216         EX-RSVTEL       =   SPACE
000217         MOVE    "Input error"   TO  MSG-ERR
000218         PERFORM ERRMSG-SEC
000219         GO  TO  MAIN-EX
000220     END-IF.
000221*
000222     PERFORM TBLEDIT.
000223
000224     MOVE    "ON"                TO  RSV-SW.
000225     MOVE  "DEMO201"  TO POW-0001
000225     CALL    "XPOWCSCLOSESHEET"  USING BY VALUE DEMO201 BY REFERENCE POW-0001 .
000226*
000227 MAIN-EX.
000228     EXIT    PROGRAM.
000229*
000230******************************************************************
000231 INDTSAVE                SECTION.        *>  入力データ退避
000232******************************************************************
000233*
000234     CALL  "XPOWCWGETTEXT"  USING BY VALUE RSVNO211  BY REFERENCE POW-0002 
000234     MOVE    POW-0002    TO  EX-RSVNUM.
000235     CALL  "XPOWCWGETTEXT"  USING BY VALUE ROOMNO211  BY REFERENCE POW-0003 
000235     MOVE    POW-0003   TO  EX-RSVROOM.
000236     CALL  "XPOWEDITGETTEXT"  USING BY VALUE RSVCNT211  BY REFERENCE POW-0004 
000236     MOVE    POW-0004   TO  EX-RSVSTAY.
000237     CALL  "XPOWEDITGETTEXT"  USING BY VALUE CSTNAME211  BY REFERENCE POW-0005 
000237     MOVE    POW-0005  TO  EX-RSVNAME.
000238     CALL  "XPOWEDITGETTEXT"  USING BY VALUE CSTTEL211  BY REFERENCE POW-0006 
000238     MOVE    POW-0006   TO  EX-RSVTEL.
000239*
000240 INDTSAVE-EX.
000241     EXIT.
000242******************************************************************
000243 ERRMSG-SEC              SECTION.
000244******************************************************************
000245*
000246     MOVE  "DEMOMSG"  TO POW-0007
000246     CALL    "XPOWCSOPENSHEET"  USING BY VALUE DEMO201 BY REFERENCE POW-0007 .
000247*
000248 ERRMSG-EX.
000249     EXIT.
000250*
000251******************************************************************
000252 TBLEDIT                 SECTION.
000253******************************************************************
000254*
000255     CALL  "XPOWCWGETTEXT"  USING BY VALUE ROOMTYP211  BY REFERENCE POW-0008 
000255     EVALUATE    POW-0008
000256         WHEN    "S1"
000257             ADD     1               TO  ROOM-RSV-NUM(1)
000258         WHEN    "S2"
000259             ADD     1               TO  ROOM-RSV-NUM(2)
000260         WHEN    "W"
000261             ADD     1               TO  ROOM-RSV-NUM(3)
000262         WHEN    "T1"
000263             ADD     1               TO  ROOM-RSV-NUM(4)
000264         WHEN    "T2"
000265             ADD     1               TO  ROOM-RSV-NUM(5)
000266         WHEN    "SU"
000267             ADD     1               TO  ROOM-RSV-NUM(6)
000268     END-EVALUATE.
000269     ADD     1                       TO  ROOM-RSV-NUM(7).
000270     MOVE    ROOM-RSV-NUM(7)             TO  TBL-IDX.
000271     MOVE    EX-RSVDATE              TO  RSV-DATE(TBL-IDX).  
000272     MOVE    EX-RSVNUM               TO  RSV-NUM(TBL-IDX).
000273     MOVE    EX-RSVROOM              TO  RSV-ROOM(TBL-IDX).
000274     CALL  "XPOWEDITGETTEXT"  USING BY VALUE RSVCNT211  BY REFERENCE POW-0009 
000274     MOVE    POW-0009   TO  STAY-NUM(TBL-IDX).
000275     CALL  "XPOWEDITGETTEXT"  USING BY VALUE CSTNAME211  BY REFERENCE POW-0010 
000275     MOVE    POW-0010  TO  GUEST-NAME(TBL-IDX).
000276     CALL  "XPOWEDITGETTEXT"  USING BY VALUE CSTTEL211  BY REFERENCE POW-0011 
000276     MOVE    POW-0011   TO  TEL-NUM(TBL-IDX).
000277*
000278 TBLEDIT-EX.
000279     EXIT.
000280 END PROGRAM "CLOSE211-CLICK".
000281 IDENTIFICATION DIVISION.
000282 PROGRAM-ID. "CANCEL211-CLICK".
000283 ENVIRONMENT DIVISION.
000284 DATA        DIVISION.
000284 WORKING-STORAGE SECTION.
000284 77 POW-0001 PIC X(14) .
000285 PROCEDURE   DIVISION.
000286******************************************************************
000287 MAIN                    SECTION.
000288******************************************************************
000289*
000290     MOVE    "OF"        TO  RSV-SW.
000291     MOVE  "DEMO201"  TO POW-0001.
000291     CALL    "XPOWCSCLOSESHEET"  USING BY VALUE DEMO201 BY REFERENCE POW-0001 .
000292*
000293 MAIN-EX.
000294     EXIT    PROGRAM.        
000295 END PROGRAM "CANCEL211-CLICK".
000296 IDENTIFICATION DIVISION.
000297 PROGRAM-ID. "NORSVLIST-DBLCLICK".
000298 ENVIRONMENT DIVISION.
000299 DATA        DIVISION.
000300 WORKING-STORAGE             SECTION.
000301 01  WK-STRNG        PIC X(64).
000302 01  UN-DATA-AREA.
000303     03  UN-DATA             PIC X(20)   OCCURS  5.
000303 77 POW-0001 PIC X(64) .
000303 77 POW-0002 PIC X(256) .
000303 77 POW-0003 PIC X(256) .
000303 77 POW-0004 PIC X(256) .
000303 77 POW-0005 PIC X(256) .
000303 77 POW-0006 PIC X(256) .
000303 77 POW-0007 PIC X(256) .
000303 77 POW-0008 PIC X(256) .
000304*
000305 PROCEDURE   DIVISION.
000306******************************************************************
000307 MAIN                SECTION.
000308******************************************************************
000309*
000310     CALL  "XPOWLISTGETSELSTRING"  USING BY VALUE NORSVLIST  BY REFERENCE POW-0001 .
000310     MOVE    POW-0001  TO  WK-STRNG.
000311     UNSTRING    WK-STRNG
000312         DELIMITED   BY  ALL SPACE
000313         INTO    UN-DATA(1)  UN-DATA(2)
000314                 UN-DATA(3)  UN-DATA(4)  UN-DATA(5)
000315     END-UNSTRING.
000316     MOVE    UN-DATA(2)          TO  EX-RSVROOM.
000317     MOVE    UN-DATA(3)          TO  EX-RSVTYPE.
000318*
000319     MOVE  EX-RSVDATE  TO POW-0002
000319     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVDATE211  BY REFERENCE POW-0002 .
000320     MOVE  EX-RSVTHIS  TO POW-0003
000320     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVNO211  BY REFERENCE POW-0003 .
000321     MOVE  EX-RSVROOM  TO POW-0004
000321     CALL  "XPOWCWSETTEXT"  USING BY VALUE ROOMNO211  BY REFERENCE POW-0004 .
000322     MOVE  EX-RSVTYPE  TO POW-0005
000322     CALL  "XPOWCWSETTEXT"  USING BY VALUE ROOMTYP211  BY REFERENCE POW-0005 .
000323*
000324     MOVE  SPACE  TO POW-0006
000324     CALL  "XPOWEDITSETTEXT"  USING BY VALUE CSTNAME211  BY REFERENCE POW-0006 .
000325     MOVE  SPACE  TO POW-0007
000325     CALL  "XPOWEDITSETTEXT"  USING BY VALUE CSTTEL211  BY REFERENCE POW-0007 .
000326     MOVE  SPACE  TO POW-0008
000326     CALL  "XPOWEDITSETTEXT"  USING BY VALUE RSVCNT211  BY REFERENCE POW-0008 .
000327 MAIN-EX.
000328     EXIT    PROGRAM.
000329 END PROGRAM "NORSVLIST-DBLCLICK".
000330 END PROGRAM "DEMO201".
