000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMO101".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-DEMO101 IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--DEMO101.
000013     03 DEMO101 PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  DEMO101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVDATE101.
000013     03 LRSVDATE101 PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  LRSVDATE101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVCNT101.
000013     03 LRSVCNT101 PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  LRSVCNT101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LRSVNO101.
000013     03 LRSVNO101 PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  LRSVNO101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LROOMNO101.
000013     03 LROOMNO101 PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  LROOMNO101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LROOMTYP101.
000013     03 LROOMTYP101 PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  LROOMTYP101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LCSTNAME101.
000013     03 LCSTNAME101 PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  LCSTNAME101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--LCSTTEL101.
000013     03 LCSTTEL101 PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  LCSTTEL101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVDATE101.
000013     03 RSVDATE101 PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  RSVDATE101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVCNT101.
000013     03 RSVCNT101 PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  RSVCNT101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--RSVNO101.
000013     03 RSVNO101 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  RSVNO101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ROOMNO101.
000013     03 ROOMNO101 PIC S9(9) COMP-5.
000013     03 POW-P012 REDEFINES  ROOMNO101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ROOMTYP101.
000013     03 ROOMTYP101 PIC S9(9) COMP-5.
000013     03 POW-P013 REDEFINES  ROOMTYP101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CSTNAME101.
000013     03 CSTNAME101 PIC S9(9) COMP-5.
000013     03 POW-P014 REDEFINES  CSTNAME101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CSTTEL101.
000013     03 CSTTEL101 PIC S9(9) COMP-5.
000013     03 POW-P015 REDEFINES  CSTTEL101 USAGE POINTER.
000013   02 POWER--HPOWOBJ--CLOSE101.
000013     03 CLOSE101 PIC S9(9) COMP-5.
000013     03 POW-P016 REDEFINES  CLOSE101 USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-DEMO101.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 16 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017******************************************************************
000018*        SHEET(ITEM) ===>    DEMO101
000019*        EVENT       ===>    WORKING
000020*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000021******************************************************************
000022*
000023*01  GL-AREA     IS  GLOBAL.
000024*
000025 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000026     03  RSV-INFORMATION.
000027         05  EX-RSVDATE      PIC X(10).
000028         05  EX-RSVNUM       PIC X(09).
000029         05  EX-RSVROOM      PIC X(04).
000030         05  EX-RSVTYPE      PIC X(02).
000031         05  EX-RSVNAME      PIC X(20).
000032         05  EX-RSVTEL       PIC X(12).
000033         05  EX-RSVSTAY      PIC X(02).
000034         05  EX-RSVTHIS      PIC X(09).
000035*
000036     03  MESSAGE-AREA.
000037         05  MSG-ERR         PIC X(80).
000038*
000039     03  SWITCH-AREA.
000040         05  RSV-SW          PIC X(02).
000041         05  SEL-SW          PIC 9(01).
000042*
000043     03  INDEX-AREA.
000044         05  DEL-IDX         PIC S9(04)  COMP-5.
000045         05  TBL-IDX         PIC S9(04)  COMP-5.
000046*
000047     03  ROOM-INFORMATION-LIST.
000048         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000049             07  ROOM-TYPE-CODE  PIC X(02).
000050             07  ROOM-TYPE-NAME  PIC X(16).
000051             07  ROOM-TOTAL-NUM  PIC 9(04).
000052             07  ROOM-RSV-NUM    PIC 9(04).
000053*
000054     03  RSV-DATE-LIST.
000055         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000056*
000057     03  RSV-NUM-LIST.
000058         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000059                                     INDEXED BY  RSVNO-IDX.
000060*
000061     03  RSV-ROOM-LIST.
000062         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000063                                     INDEXED BY  RSV-IDX.
000064*
000065     03  ROOM-LIST.
000066         04  ROOM-TYPE-LIST.
000067             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000068                 07  GUEST-ROOM          OCCURS  20  TIMES.
000069                     09  GUEST-ROOM-NUM  PIC X(04).
000070                     09  GUEST-ROOM-TYPE PIC X(02).
000071         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000072             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000073                 07  ROOM-NUM        PIC X(04).
000074                 07  ROOM-TYPE       PIC X(02).  
000075*
000076     03  NAME-LIST.
000077         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000078                                 INDEXED BY  NAME-IDX.
000079*
000080     03  TEL-LIST.
000081         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000082                                         INDEXED BY  TEL-IDX.
000083*
000084     03  STAY-LIST.
000085         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000086                                     INDEXED BY  CNT-IDX.
000087*
000088 CONSTANT SECTION.
000089 LINKAGE SECTION.
000090 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000091 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000092                    USAGE IS COMPUTATIONAL-5.
000093 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000094                    USAGE IS COMPUTATIONAL-5.
000095 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000096                    USAGE IS COMPUTATIONAL-5.
000097 PROCEDURE DIVISION
000098     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000099     EVALUATE POWER--MESSAGE
000100     WHEN 1025
000101         EVALUATE POWER--HPOWOBJ
000102         WHEN POWER--HPOWOBJ--CLOSE101
000103             EVALUATE POWER--NOTIFY
000104             WHEN 1 
000105                CALL "CLOSE101-CLICK"
000106             END-EVALUATE
000107         END-EVALUATE
000108     WHEN 1024
000109         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000110     WHEN 1036
000111         CALL "DEMO101-OPENED"
000112     WHEN 1038
000113         CALL "DEMO101-START"
000114     END-EVALUATE
000115     EXIT PROGRAM.
000116 IDENTIFICATION DIVISION.
000117 PROGRAM-ID. "DEMO101-OPENED".
000118 ENVIRONMENT DIVISION.
000119 DATA        DIVISION.
000119 WORKING-STORAGE SECTION.
000119 77 POW-0001 PIC X(256) .
000119 77 POW-0002 PIC X(256) .
000119 77 POW-0003 PIC X(256) .
000119 77 POW-0004 PIC X(256) .
000119 77 POW-0005 PIC X(256) .
000119 77 POW-0006 PIC X(256) .
000119 77 POW-0007 PIC X(256) .
000120 PROCEDURE   DIVISION.
000121******************************************************************
000122 MAIN                    SECTION.
000123******************************************************************
000124*
000125     MOVE  EX-RSVDATE  TO POW-0001.
000125     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVDATE101  BY REFERENCE POW-0001 .
000126     MOVE  EX-RSVSTAY  TO POW-0002.
000126     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVCNT101  BY REFERENCE POW-0002 .  
000127     MOVE  EX-RSVNUM  TO POW-0003.
000127     CALL  "XPOWCWSETTEXT"  USING BY VALUE RSVNO101  BY REFERENCE POW-0003 .
000128     MOVE  EX-RSVROOM  TO POW-0004.
000128     CALL  "XPOWCWSETTEXT"  USING BY VALUE ROOMNO101  BY REFERENCE POW-0004 .
000129     MOVE  EX-RSVTYPE  TO POW-0005.
000129     CALL  "XPOWCWSETTEXT"  USING BY VALUE ROOMTYP101  BY REFERENCE POW-0005 .
000130     MOVE  EX-RSVNAME  TO POW-0006.
000130     CALL  "XPOWCWSETTEXT"  USING BY VALUE CSTNAME101  BY REFERENCE POW-0006 .
000131     MOVE  EX-RSVTEL  TO POW-0007.
000131     CALL  "XPOWCWSETTEXT"  USING BY VALUE CSTTEL101  BY REFERENCE POW-0007 .
000132*
000133 MAIN-EX.
000134     EXIT    PROGRAM.
000135 END PROGRAM "DEMO101-OPENED".
000136 IDENTIFICATION DIVISION.
000137 PROGRAM-ID. "DEMO101-START".
000138 PROCEDURE DIVISION.
000139     EXIT PROGRAM.
000140 END PROGRAM "DEMO101-START".
000141 IDENTIFICATION DIVISION.
000142 PROGRAM-ID. "CLOSE101-CLICK".
000143 ENVIRONMENT DIVISION.
000144 DATA        DIVISION.
000144 WORKING-STORAGE SECTION.
000145 PROCEDURE   DIVISION.
000146******************************************************************
000147 MAIN                    SECTION.
000148******************************************************************
000149*
000150     CALL    "XPOWCSCLOSEMYSELF"  USING BY VALUE DEMO101 .
000151*
000152 MAIN-EX.
000153     EXIT    PROGRAM.        
000154 END PROGRAM "CLOSE101-CLICK".
000155 END PROGRAM "DEMO101".
