000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMO201".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 FILE SECTION.
000010 WORKING-STORAGE SECTION.
000011******************************************************************
000012*        SHEET(ITEM) ===>    DEMO201
000013*        EVENT       ===>    WORKING
000014*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000015******************************************************************
000016*
000017*01  GL-AREA     IS  GLOBAL.
000018*
000019 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000020     03  RSV-INFORMATION.
000021         05  EX-RSVDATE      PIC X(10).
000022         05  EX-RSVNUM       PIC X(09).
000023         05  EX-RSVROOM      PIC X(04).
000024         05  EX-RSVTYPE      PIC X(02).
000025         05  EX-RSVNAME      PIC X(20).
000026         05  EX-RSVTEL       PIC X(12).
000027         05  EX-RSVSTAY      PIC X(02).
000028         05  EX-RSVTHIS      PIC X(09).
000029*
000030     03  MESSAGE-AREA.
000031         05  MSG-ERR         PIC X(80).
000032*
000033     03  SWITCH-AREA.
000034         05  RSV-SW          PIC X(02).
000035         05  SEL-SW          PIC 9(01).
000036*
000037     03  INDEX-AREA.
000038         05  DEL-IDX         PIC S9(04)  COMP-5.
000039         05  TBL-IDX         PIC S9(04)  COMP-5.
000040*
000041     03  ROOM-INFORMATION-LIST.
000042         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000043             07  ROOM-TYPE-CODE  PIC X(02).
000044             07  ROOM-TYPE-NAME  PIC X(16).
000045             07  ROOM-TOTAL-NUM  PIC 9(04).
000046             07  ROOM-RSV-NUM    PIC 9(04).
000047*
000048     03  RSV-DATE-LIST.
000049         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000050*
000051     03  RSV-NUM-LIST.
000052         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000053                                     INDEXED BY  RSVNO-IDX.
000054*
000055     03  RSV-ROOM-LIST.
000056         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000057                                     INDEXED BY  RSV-IDX.
000058*
000059     03  ROOM-LIST.
000060         04  ROOM-TYPE-LIST.
000061             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000062                 07  GUEST-ROOM          OCCURS  20  TIMES.
000063                     09  GUEST-ROOM-NUM  PIC X(04).
000064                     09  GUEST-ROOM-TYPE PIC X(02).
000065         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000066             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000067                 07  ROOM-NUM        PIC X(04).
000068                 07  ROOM-TYPE       PIC X(02).  
000069*
000070     03  NAME-LIST.
000071         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000072                                 INDEXED BY  NAME-IDX.
000073*
000074     03  TEL-LIST.
000075         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000076                                         INDEXED BY  TEL-IDX.
000077*
000078     03  STAY-LIST.
000079         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000080                                     INDEXED BY  CNT-IDX.
000081*
000082 01 POWER--HPOWOBJS-DEMO201 IS GLOBAL IS EXTERNAL.
000083   02 POWER--HPOWOBJ--DEMO201.
000083     03 DEMO201 PIC S9(9) COMP-5.
000083     03 POW-P001 REDEFINES  DEMO201 USAGE POINTER.
000083   02 POWER--HPOWOBJ--GROUP3.
000083     03 GROUP3 PIC S9(9) COMP-5.
000083     03 POW-P002 REDEFINES  GROUP3 USAGE POINTER.
000083   02 POWER--HPOWOBJ--NORSVLIST.
000083     03 NORSVLIST PIC S9(9) COMP-5.
000083     03 POW-P003 REDEFINES  NORSVLIST USAGE POINTER.
000083   02 POWER--HPOWOBJ--GROUP2.
000083     03 GROUP2 PIC S9(9) COMP-5.
000083     03 POW-P004 REDEFINES  GROUP2 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVDATE211.
000083     03 LRSVDATE211 PIC S9(9) COMP-5.
000083     03 POW-P005 REDEFINES  LRSVDATE211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LROOMTYP211.
000083     03 LROOMTYP211 PIC S9(9) COMP-5.
000083     03 POW-P006 REDEFINES  LROOMTYP211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LROOMNO211.
000083     03 LROOMNO211 PIC S9(9) COMP-5.
000083     03 POW-P007 REDEFINES  LROOMNO211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVNO211.
000083     03 LRSVNO211 PIC S9(9) COMP-5.
000083     03 POW-P008 REDEFINES  LRSVNO211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVDATE211.
000083     03 RSVDATE211 PIC S9(9) COMP-5.
000083     03 POW-P009 REDEFINES  RSVDATE211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--ROOMTYP211.
000083     03 ROOMTYP211 PIC S9(9) COMP-5.
000083     03 POW-P010 REDEFINES  ROOMTYP211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--ROOMNO211.
000083     03 ROOMNO211 PIC S9(9) COMP-5.
000083     03 POW-P011 REDEFINES  ROOMNO211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVNO211.
000083     03 RSVNO211 PIC S9(9) COMP-5.
000083     03 POW-P012 REDEFINES  RSVNO211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--GROUP1.
000083     03 GROUP1 PIC S9(9) COMP-5.
000083     03 POW-P013 REDEFINES  GROUP1 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LCSTNAME211.
000083     03 LCSTNAME211 PIC S9(9) COMP-5.
000083     03 POW-P014 REDEFINES  LCSTNAME211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LCSTTEL211.
000083     03 LCSTTEL211 PIC S9(9) COMP-5.
000083     03 POW-P015 REDEFINES  LCSTTEL211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVCNT211.
000083     03 LRSVCNT211 PIC S9(9) COMP-5.
000083     03 POW-P016 REDEFINES  LRSVCNT211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CSTNAME211.
000083     03 CSTNAME211 PIC S9(9) COMP-5.
000083     03 POW-P017 REDEFINES  CSTNAME211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CSTTEL211.
000083     03 CSTTEL211 PIC S9(9) COMP-5.
000083     03 POW-P018 REDEFINES  CSTTEL211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVCNT211.
000083     03 RSVCNT211 PIC S9(9) COMP-5.
000083     03 POW-P019 REDEFINES  RSVCNT211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CLOSE211.
000083     03 CLOSE211 PIC S9(9) COMP-5.
000083     03 POW-P020 REDEFINES  CLOSE211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CANCEL211.
000083     03 CANCEL211 PIC S9(9) COMP-5.
000083     03 POW-P021 REDEFINES  CANCEL211 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LABEL28.
000083     03 LABEL28 PIC S9(9) COMP-5.
000083     03 POW-P022 REDEFINES  LABEL28 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LABEL29.
000083     03 LABEL29 PIC S9(9) COMP-5.
000083     03 POW-P023 REDEFINES  LABEL29 USAGE POINTER.
000084 01  REDEFINES POWER--HPOWOBJS-DEMO201.
000085   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 23 TIMES.
000086 LOCAL-STORAGE SECTION.
000087 LINKAGE SECTION.
000088 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000089 01  POWER--ID      IS GLOBAL PICTURE IS S9(4)
000090                    USAGE IS COMPUTATIONAL-5.
000091 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(4)
000092                    USAGE IS COMPUTATIONAL-5.
000093 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(4)
000094                    USAGE IS COMPUTATIONAL-5.
000095 PROCEDURE DIVISION
000096     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000097     EVALUATE POWER--MESSAGE
000098     WHEN 1025
000099         EVALUATE POWER--HPOWOBJ
000100         WHEN POWER--HPOWOBJ--CLOSE211
000101             EVALUATE POWER--NOTIFY
000102             WHEN 1 
000103                CALL "CLOSE211-CLICK"
000104             END-EVALUATE
000105         WHEN POWER--HPOWOBJ--CANCEL211
000106             EVALUATE POWER--NOTIFY
000107             WHEN 1 
000108                CALL "CANCEL211-CLICK"
000109             END-EVALUATE
000110         WHEN POWER--HPOWOBJ--NORSVLIST
000111             EVALUATE POWER--NOTIFY
000112             WHEN 2 
000113                CALL "NORSVLIST-DBLCLICK"
000114             END-EVALUATE
000115         END-EVALUATE
000116     WHEN 1024
000117         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000118     WHEN 1036
000119         CALL "DEMO201-OPENED"
000120     WHEN 1038
000121         CALL "DEMO201-START"
000122     END-EVALUATE
000123     EXIT PROGRAM.
000124 IDENTIFICATION DIVISION.
000125 PROGRAM-ID. "DEMO201-OPENED".
000126 ENVIRONMENT DIVISION.
000127 DATA        DIVISION.
000128 WORKING-STORAGE         SECTION.
000129*
000130***  シート内ワークエリア    ***
000131*
000132 01  WORK-AREA.
000133     03  WK-TYPE             PIC X(02).
000134     03  WK-IDX1             PIC S9(08)  COMP-5  VALUE   0.
000135     03  WK-IDX2             PIC S9(08)  COMP-5  VALUE   0.
000136     03  WK-STRNG            PIC X(64).
000136 77 POW-0001 PIC X(256) .
000136 77 POW-0002 PIC X(256) .
000136 77 POW-0003 PIC X(256) .
000136 77 POW-0004 PIC X(64) .
000137*
000138 PROCEDURE   DIVISION.
000139******************************************************************
000140 MAIN                    SECTION.
000141******************************************************************
000142*
000143     MOVE  EX-RSVDATE  TO POW-0001.
000143     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVDATE211  BY
000143      REFERENCE POW-0001 .
000144     MOVE  EX-RSVTYPE  TO POW-0002.
000144     CALL  "_XPOWCWSETTEXT"  USING BY VALUE ROOMTYP211  BY
000144      REFERENCE POW-0002 . 
000145     MOVE    EX-RSVTYPE  TO  WK-TYPE.
000146     MOVE  EX-RSVNUM  TO POW-0003.
000146     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVNO211  BY
000146      REFERENCE POW-0003 .
000147     MOVE    SEL-SW      TO  WK-IDX1.
000148*
000149***  EDIT VACANT INFORMATION ***
000150     PERFORM ROOM-SRH
000151         VARYING WK-IDX2 FROM    1   BY  1
000152         UNTIL   WK-IDX2 >   20  OR
000153                 GUEST-ROOM-NUM(WK-IDX1 WK-IDX2) =   SPACE.
000154*
000155 MAIN-END.
000156     EXIT    PROGRAM.
000157*
000158******************************************************************
000159 ROOM-SRH            SECTION.        *>  SEARCH VACANT 
000160******************************************************************
000161*
000162     SET     RSV-IDX     TO  1.
000163     SEARCH  RSV-ROOM
000164         AT  END
000165             PERFORM COMB-EDT
000166         WHEN    RSV-ROOM(RSV-IDX)   =
000167                 GUEST-ROOM-NUM(WK-IDX1 WK-IDX2)
000168             CONTINUE
000169     END-SEARCH.
000170*
000171 ROOM-EX.
000172     EXIT.
000173******************************************************************
000174 COMB-EDT                SECTION.
000175******************************************************************
000176*
000177     STRING  "  "
000178             GUEST-ROOM-NUM(WK-IDX1 WK-IDX2)
000179             "    "
000180             GUEST-ROOM-TYPE(WK-IDX1 WK-IDX2)
000181             " "
000182             DELIMITED   BY SIZE
000183             INTO    WK-STRNG
000184     END-STRING.         
000185     MOVE  WK-STRNG  TO POW-0004
000185     CALL    "_XPOWLISTADDSTRING"  USING BY VALUE NORSVLIST
000185      BY REFERENCE POW-0004 .
000186*
000187 COMB-EX.
000188     EXIT.       
000189 END PROGRAM "DEMO201-OPENED".
000190 IDENTIFICATION DIVISION.
000191 PROGRAM-ID. "DEMO201-START".
000192 PROCEDURE DIVISION.
000193     EXIT PROGRAM.
000194 END PROGRAM "DEMO201-START".
000195 IDENTIFICATION DIVISION.
000196 PROGRAM-ID. "CLOSE211-CLICK".
000197 ENVIRONMENT DIVISION.
000198 DATA        DIVISION.
000198 WORKING-STORAGE SECTION.
000198 77 POW-0001 PIC X(14) .
000198 77 POW-0002 PIC X(256) .
000198 77 POW-0003 PIC X(256) .
000198 77 POW-0004 PIC X(256) .
000198 77 POW-0005 PIC X(256) .
000198 77 POW-0006 PIC X(256) .
000198 77 POW-0007 PIC X(14) .
000198 77 POW-0008 PIC X(256) .
000198 77 POW-0009 PIC X(256) .
000198 77 POW-0010 PIC X(256) .
000198 77 POW-0011 PIC X(256) .
000199 PROCEDURE   DIVISION.
000200******************************************************************
000201 MAIN                    SECTION.
000202******************************************************************
000203*
000204     PERFORM INDTSAVE.
000205*
000206***  ERROR CHECK     *** 
000207     IF  EX-RSVROOM      =   SPACE
000208         MOVE    "Select room number."   TO  MSG-ERR
000209         PERFORM ERRMSG-SEC
000210         GO  TO  MAIN-EX
000211     END-IF.
000212     IF  EX-RSVSTAY      =   SPACE   OR
000213         EX-RSVNAME      =   SPACE   OR
000214         EX-RSVTEL       =   SPACE
000215         MOVE    "Input error"   TO  MSG-ERR
000216         PERFORM ERRMSG-SEC
000217         GO  TO  MAIN-EX
000218     END-IF.
000219*
000220     PERFORM TBLEDIT.
000221
000222     MOVE    "ON"                TO  RSV-SW.
000223     MOVE  "DEMO201"  TO POW-0001
000223     CALL    "_XPOWCSCLOSESHEET"  USING BY VALUE DEMO201
000223      BY REFERENCE POW-0001 .
000224*
000225 MAIN-EX.
000226     EXIT    PROGRAM.
000227*
000228******************************************************************
000229 INDTSAVE                SECTION.        *>  入力データ退避
000230******************************************************************
000231*
000232     CALL  "_XPOWCWGETTEXT"  USING BY VALUE RSVNO211  BY
000232      REFERENCE POW-0002 
000232     MOVE    POW-0002    TO  EX-RSVNUM.
000233     CALL  "_XPOWCWGETTEXT"  USING BY VALUE ROOMNO211  BY
000233      REFERENCE POW-0003 
000233     MOVE    POW-0003   TO  EX-RSVROOM.
000234     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE RSVCNT211  BY
000234      REFERENCE POW-0004 
000234     MOVE    POW-0004   TO  EX-RSVSTAY.
000235     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE CSTNAME211  BY
000235      REFERENCE POW-0005 
000235     MOVE    POW-0005  TO  EX-RSVNAME.
000236     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE CSTTEL211  BY
000236      REFERENCE POW-0006 
000236     MOVE    POW-0006   TO  EX-RSVTEL.
000237*
000238 INDTSAVE-EX.
000239     EXIT.
000240******************************************************************
000241 ERRMSG-SEC              SECTION.
000242******************************************************************
000243*
000244     MOVE  "DEMOMSG"  TO POW-0007
000244     CALL    "_XPOWCSOPENSHEET"  USING BY VALUE DEMO201
000244      BY REFERENCE POW-0007 .
000245*
000246 ERRMSG-EX.
000247     EXIT.
000248*
000249******************************************************************
000250 TBLEDIT                 SECTION.
000251******************************************************************
000252*
000253     CALL  "_XPOWCWGETTEXT"  USING BY VALUE ROOMTYP211  BY
000253      REFERENCE POW-0008 
000253     EVALUATE    POW-0008
000254         WHEN    "S1"
000255             ADD     1               TO  ROOM-RSV-NUM(1)
000256         WHEN    "S2"
000257             ADD     1               TO  ROOM-RSV-NUM(2)
000258         WHEN    "W"
000259             ADD     1               TO  ROOM-RSV-NUM(3)
000260         WHEN    "T1"
000261             ADD     1               TO  ROOM-RSV-NUM(4)
000262         WHEN    "T2"
000263             ADD     1               TO  ROOM-RSV-NUM(5)
000264         WHEN    "SU"
000265             ADD     1               TO  ROOM-RSV-NUM(6)
000266     END-EVALUATE.
000267     ADD     1                       TO  ROOM-RSV-NUM(7).
000268     MOVE    ROOM-RSV-NUM(7)             TO  TBL-IDX.
000269     MOVE    EX-RSVDATE              TO  RSV-DATE(TBL-IDX).  
000270     MOVE    EX-RSVNUM               TO  RSV-NUM(TBL-IDX).
000271     MOVE    EX-RSVROOM              TO  RSV-ROOM(TBL-IDX).
000272     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE RSVCNT211  BY
000272      REFERENCE POW-0009 
000272     MOVE    POW-0009   TO  STAY-NUM(TBL-IDX).
000273     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE CSTNAME211  BY
000273      REFERENCE POW-0010 
000273     MOVE    POW-0010  TO  GUEST-NAME(TBL-IDX).
000274     CALL  "_XPOWEDITGETTEXT"  USING BY VALUE CSTTEL211  BY
000274      REFERENCE POW-0011 
000274     MOVE    POW-0011   TO  TEL-NUM(TBL-IDX).
000275*
000276 TBLEDIT-EX.
000277     EXIT.
000278 END PROGRAM "CLOSE211-CLICK".
000279 IDENTIFICATION DIVISION.
000280 PROGRAM-ID. "CANCEL211-CLICK".
000281 ENVIRONMENT DIVISION.
000282 DATA        DIVISION.
000282 WORKING-STORAGE SECTION.
000282 77 POW-0001 PIC X(14) .
000283 PROCEDURE   DIVISION.
000284******************************************************************
000285 MAIN                    SECTION.
000286******************************************************************
000287*
000288     MOVE    "OF"        TO  RSV-SW.
000289     MOVE  "DEMO201"  TO POW-0001.
000289     CALL    "_XPOWCSCLOSESHEET"  USING BY VALUE DEMO201
000289      BY REFERENCE POW-0001 .
000290*
000291 MAIN-EX.
000292     EXIT    PROGRAM.        
000293 END PROGRAM "CANCEL211-CLICK".
000294 IDENTIFICATION DIVISION.
000295 PROGRAM-ID. "NORSVLIST-DBLCLICK".
000296 ENVIRONMENT DIVISION.
000297 DATA        DIVISION.
000298 WORKING-STORAGE             SECTION.
000299 01  WK-STRNG        PIC X(64).
000300 01  UN-DATA-AREA.
000301     03  UN-DATA             PIC X(20)   OCCURS  5.
000301 77 POW-0001 PIC X(64) .
000301 77 POW-0002 PIC X(256) .
000301 77 POW-0003 PIC X(256) .
000301 77 POW-0004 PIC X(256) .
000301 77 POW-0005 PIC X(256) .
000301 77 POW-0006 PIC X(256) .
000301 77 POW-0007 PIC X(256) .
000301 77 POW-0008 PIC X(256) .
000302*
000303 PROCEDURE   DIVISION.
000304******************************************************************
000305 MAIN                SECTION.
000306******************************************************************
000307*
000308     CALL  "_XPOWLISTGETSELSTRING"  USING BY VALUE NORSVLIST
000308       BY REFERENCE POW-0001 .
000308     MOVE    POW-0001  TO  WK-STRNG.
000309     UNSTRING    WK-STRNG
000310         DELIMITED   BY  ALL SPACE
000311         INTO    UN-DATA(1)  UN-DATA(2)
000312                 UN-DATA(3)  UN-DATA(4)  UN-DATA(5)
000313     END-UNSTRING.
000314     MOVE    UN-DATA(2)          TO  EX-RSVROOM.
000315     MOVE    UN-DATA(3)          TO  EX-RSVTYPE.
000316*
000317     MOVE  EX-RSVDATE  TO POW-0002
000317     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVDATE211  BY
000317      REFERENCE POW-0002 .
000318     MOVE  EX-RSVTHIS  TO POW-0003
000318     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVNO211  BY
000318      REFERENCE POW-0003 .
000319     MOVE  EX-RSVROOM  TO POW-0004
000319     CALL  "_XPOWCWSETTEXT"  USING BY VALUE ROOMNO211  BY
000319      REFERENCE POW-0004 .
000320     MOVE  EX-RSVTYPE  TO POW-0005
000320     CALL  "_XPOWCWSETTEXT"  USING BY VALUE ROOMTYP211  BY
000320      REFERENCE POW-0005 .
000321*
000322     MOVE  SPACE  TO POW-0006
000322     CALL  "_XPOWEDITSETTEXT"  USING BY VALUE CSTNAME211  BY
000322      REFERENCE POW-0006 .
000323     MOVE  SPACE  TO POW-0007
000323     CALL  "_XPOWEDITSETTEXT"  USING BY VALUE CSTTEL211  BY
000323      REFERENCE POW-0007 .
000324     MOVE  SPACE  TO POW-0008
000324     CALL  "_XPOWEDITSETTEXT"  USING BY VALUE RSVCNT211  BY
000324      REFERENCE POW-0008 .
000325 MAIN-EX.
000326     EXIT    PROGRAM.
000327 END PROGRAM "NORSVLIST-DBLCLICK".
000328 END PROGRAM "DEMO201".
