000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMOMSG".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-DEMOMSG IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--DEMOMSG.
000013     03 DEMOMSG PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  DEMOMSG USAGE POINTER.
000013   02 POWER--HPOWOBJ--MSG.
000013     03 MSG PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  MSG USAGE POINTER.
000013   02 POWER--HPOWOBJ--PUSHOK.
000013     03 PUSHOK PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  PUSHOK USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-DEMOMSG.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 3 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017******************************************************************
000018*        SHEET(ITEM) ===>    DEMOMSG
000019*        EVENT       ===>    WORKING
000020*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000021******************************************************************
000022*
000023 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000024     03  RSV-INFORMATION.
000025         05  EX-RSVDATE      PIC X(10).
000026         05  EX-RSVNUM       PIC X(09).
000027         05  EX-RSVROOM      PIC X(04).
000028         05  EX-RSVTYPE      PIC X(02).
000029         05  EX-RSVNAME      PIC X(20).
000030         05  EX-RSVTEL       PIC X(12).
000031         05  EX-RSVSTAY      PIC X(02).
000032         05  EX-RSVTHIS      PIC X(09).
000033*
000034     03  MESSAGE-AREA.
000035         05  MSG-ERR         PIC X(80).
000036*
000037     03  SWITCH-AREA.
000038         05  RSV-SW          PIC X(02).
000039         05  SEL-SW          PIC 9(01).
000040*
000041     03  INDEX-AREA.
000042         05  DEL-IDX         PIC S9(04)  COMP-5.
000043         05  TBL-IDX         PIC S9(04)  COMP-5.
000044*
000045     03  ROOM-INFORMATION-LIST.
000046         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000047             07  ROOM-TYPE-CODE  PIC X(02).
000048             07  ROOM-TYPE-NAME  PIC X(16).
000049             07  ROOM-TOTAL-NUM  PIC 9(04).
000050             07  ROOM-RSV-NUM    PIC 9(04).
000051*
000052     03  RSV-DATE-LIST.
000053         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000054*
000055     03  RSV-NUM-LIST.
000056         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000057                                     INDEXED BY  RSVNO-IDX.
000058*
000059     03  RSV-ROOM-LIST.
000060         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000061                                     INDEXED BY  RSV-IDX.
000062*
000063     03  ROOM-LIST.
000064         04  ROOM-TYPE-LIST.
000065             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000066                 07  GUEST-ROOM          OCCURS  20  TIMES.
000067                     09  GUEST-ROOM-NUM  PIC X(04).
000068                     09  GUEST-ROOM-TYPE PIC X(02).
000069         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000070             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000071                 07  ROOM-NUM        PIC X(04).
000072                 07  ROOM-TYPE       PIC X(02).  
000073*
000074     03  NAME-LIST.
000075         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000076                                 INDEXED BY  NAME-IDX.
000077*
000078     03  TEL-LIST.
000079         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000080                                         INDEXED BY  TEL-IDX.
000081*
000082     03  STAY-LIST.
000083         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000084                                     INDEXED BY  CNT-IDX.
000085*
000086 CONSTANT SECTION.
000087 LINKAGE SECTION.
000088 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000089 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000090                    USAGE IS COMPUTATIONAL-5.
000091 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000092                    USAGE IS COMPUTATIONAL-5.
000093 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000094                    USAGE IS COMPUTATIONAL-5.
000095 PROCEDURE DIVISION
000096     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000097     EVALUATE POWER--MESSAGE
000098     WHEN 1025
000099         EVALUATE POWER--HPOWOBJ
000100         WHEN POWER--HPOWOBJ--PUSHOK
000101             EVALUATE POWER--NOTIFY
000102             WHEN 1 
000103                CALL "PUSHOK-CLICK"
000104             END-EVALUATE
000105         END-EVALUATE
000106     WHEN 1024
000107         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000108     WHEN 1036
000109         CALL "DEMOMSG-OPENED"
000110     WHEN 1038
000111         CALL "DEMOMSG-START"
000112     END-EVALUATE
000113     EXIT PROGRAM.
000114 IDENTIFICATION DIVISION.
000115 PROGRAM-ID. "DEMOMSG-OPENED".
000116 ENVIRONMENT DIVISION.
000117 DATA        DIVISION.
000117 WORKING-STORAGE SECTION.
000117 77 POW-0001 PIC X(256) .
000118 PROCEDURE   DIVISION.
000119******************************************************************
000120 MAIN                SECTION.
000121******************************************************************
000122*
000123     MOVE  MSG-ERR  TO POW-0001.
000123     CALL  "XPOWCWSETTEXT"  USING BY VALUE MSG  BY REFERENCE POW-0001 .
000124*
000125 MAIN-EX.
000126     EXIT    PROGRAM.
000127 END PROGRAM "DEMOMSG-OPENED".
000128 IDENTIFICATION DIVISION.
000129 PROGRAM-ID. "DEMOMSG-START".
000130 PROCEDURE DIVISION.
000131     EXIT PROGRAM.
000132 END PROGRAM "DEMOMSG-START".
000133 IDENTIFICATION DIVISION.
000134 PROGRAM-ID. "PUSHOK-CLICK".
000135 ENVIRONMENT DIVISION.
000136 DATA        DIVISION.
000136 WORKING-STORAGE SECTION.
000136 77 POW-0001 PIC X(14) .
000137 PROCEDURE   DIVISION.
000138******************************************************************
000139 MAIN                SECTION.
000140******************************************************************
000141*
000142     MOVE  "DEMOMSG"  TO POW-0001.
000142     CALL    "XPOWCSCLOSESHEET"  USING BY VALUE DEMOMSG BY REFERENCE POW-0001 .
000143*
000144 MAIN-EX.
000145     EXIT    PROGRAM.
000146 END PROGRAM "PUSHOK-CLICK".
000147 END PROGRAM "DEMOMSG".
