000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "DEMO101".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 FILE SECTION.
000010 WORKING-STORAGE SECTION.
000011******************************************************************
000012*        SHEET(ITEM) ===>    DEMO101
000013*        EVENT       ===>    WORKING
000014*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000015******************************************************************
000016*
000017*01  GL-AREA     IS  GLOBAL.
000018*
000019 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000020     03  RSV-INFORMATION.
000021         05  EX-RSVDATE      PIC X(10).
000022         05  EX-RSVNUM       PIC X(09).
000023         05  EX-RSVROOM      PIC X(04).
000024         05  EX-RSVTYPE      PIC X(02).
000025         05  EX-RSVNAME      PIC X(20).
000026         05  EX-RSVTEL       PIC X(12).
000027         05  EX-RSVSTAY      PIC X(02).
000028         05  EX-RSVTHIS      PIC X(09).
000029*
000030     03  MESSAGE-AREA.
000031         05  MSG-ERR         PIC X(80).
000032*
000033     03  SWITCH-AREA.
000034         05  RSV-SW          PIC X(02).
000035         05  SEL-SW          PIC 9(01).
000036*
000037     03  INDEX-AREA.
000038         05  DEL-IDX         PIC S9(04)  COMP-5.
000039         05  TBL-IDX         PIC S9(04)  COMP-5.
000040*
000041     03  ROOM-INFORMATION-LIST.
000042         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000043             07  ROOM-TYPE-CODE  PIC X(02).
000044             07  ROOM-TYPE-NAME  PIC X(16).
000045             07  ROOM-TOTAL-NUM  PIC 9(04).
000046             07  ROOM-RSV-NUM    PIC 9(04).
000047*
000048     03  RSV-DATE-LIST.
000049         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000050*
000051     03  RSV-NUM-LIST.
000052         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000053                                     INDEXED BY  RSVNO-IDX.
000054*
000055     03  RSV-ROOM-LIST.
000056         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000057                                     INDEXED BY  RSV-IDX.
000058*
000059     03  ROOM-LIST.
000060         04  ROOM-TYPE-LIST.
000061             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000062                 07  GUEST-ROOM          OCCURS  20  TIMES.
000063                     09  GUEST-ROOM-NUM  PIC X(04).
000064                     09  GUEST-ROOM-TYPE PIC X(02).
000065         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000066             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000067                 07  ROOM-NUM        PIC X(04).
000068                 07  ROOM-TYPE       PIC X(02).  
000069*
000070     03  NAME-LIST.
000071         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000072                                 INDEXED BY  NAME-IDX.
000073*
000074     03  TEL-LIST.
000075         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000076                                         INDEXED BY  TEL-IDX.
000077*
000078     03  STAY-LIST.
000079         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000080                                     INDEXED BY  CNT-IDX.
000081*
000082 01 POWER--HPOWOBJS-DEMO101 IS GLOBAL IS EXTERNAL.
000083   02 POWER--HPOWOBJ--DEMO101.
000083     03 DEMO101 PIC S9(9) COMP-5.
000083     03 POW-P001 REDEFINES  DEMO101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVDATE101.
000083     03 LRSVDATE101 PIC S9(9) COMP-5.
000083     03 POW-P002 REDEFINES  LRSVDATE101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVCNT101.
000083     03 LRSVCNT101 PIC S9(9) COMP-5.
000083     03 POW-P003 REDEFINES  LRSVCNT101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LRSVNO101.
000083     03 LRSVNO101 PIC S9(9) COMP-5.
000083     03 POW-P004 REDEFINES  LRSVNO101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LROOMNO101.
000083     03 LROOMNO101 PIC S9(9) COMP-5.
000083     03 POW-P005 REDEFINES  LROOMNO101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LROOMTYP101.
000083     03 LROOMTYP101 PIC S9(9) COMP-5.
000083     03 POW-P006 REDEFINES  LROOMTYP101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LCSTNAME101.
000083     03 LCSTNAME101 PIC S9(9) COMP-5.
000083     03 POW-P007 REDEFINES  LCSTNAME101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--LCSTTEL101.
000083     03 LCSTTEL101 PIC S9(9) COMP-5.
000083     03 POW-P008 REDEFINES  LCSTTEL101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVDATE101.
000083     03 RSVDATE101 PIC S9(9) COMP-5.
000083     03 POW-P009 REDEFINES  RSVDATE101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVCNT101.
000083     03 RSVCNT101 PIC S9(9) COMP-5.
000083     03 POW-P010 REDEFINES  RSVCNT101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--RSVNO101.
000083     03 RSVNO101 PIC S9(9) COMP-5.
000083     03 POW-P011 REDEFINES  RSVNO101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--ROOMNO101.
000083     03 ROOMNO101 PIC S9(9) COMP-5.
000083     03 POW-P012 REDEFINES  ROOMNO101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--ROOMTYP101.
000083     03 ROOMTYP101 PIC S9(9) COMP-5.
000083     03 POW-P013 REDEFINES  ROOMTYP101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CSTNAME101.
000083     03 CSTNAME101 PIC S9(9) COMP-5.
000083     03 POW-P014 REDEFINES  CSTNAME101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CSTTEL101.
000083     03 CSTTEL101 PIC S9(9) COMP-5.
000083     03 POW-P015 REDEFINES  CSTTEL101 USAGE POINTER.
000083   02 POWER--HPOWOBJ--CLOSE101.
000083     03 CLOSE101 PIC S9(9) COMP-5.
000083     03 POW-P016 REDEFINES  CLOSE101 USAGE POINTER.
000084 01  REDEFINES POWER--HPOWOBJS-DEMO101.
000085   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 16 TIMES.
000086 LOCAL-STORAGE SECTION.
000087 LINKAGE SECTION.
000088 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000089 01  POWER--ID      IS GLOBAL PICTURE IS S9(4)
000090                    USAGE IS COMPUTATIONAL-5.
000091 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(4)
000092                    USAGE IS COMPUTATIONAL-5.
000093 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(4)
000094                    USAGE IS COMPUTATIONAL-5.
000095 PROCEDURE DIVISION
000096     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000097     EVALUATE POWER--MESSAGE
000098     WHEN 1025
000099         EVALUATE POWER--HPOWOBJ
000100         WHEN POWER--HPOWOBJ--CLOSE101
000101             EVALUATE POWER--NOTIFY
000102             WHEN 1 
000103                CALL "CLOSE101-CLICK"
000104             END-EVALUATE
000105         END-EVALUATE
000106     WHEN 1024
000107         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000108     WHEN 1036
000109         CALL "DEMO101-OPENED"
000110     WHEN 1038
000111         CALL "DEMO101-START"
000112     END-EVALUATE
000113     EXIT PROGRAM.
000114 IDENTIFICATION DIVISION.
000115 PROGRAM-ID. "DEMO101-OPENED".
000116 ENVIRONMENT DIVISION.
000117 DATA        DIVISION.
000117 WORKING-STORAGE SECTION.
000117 77 POW-0001 PIC X(256) .
000117 77 POW-0002 PIC X(256) .
000117 77 POW-0003 PIC X(256) .
000117 77 POW-0004 PIC X(256) .
000117 77 POW-0005 PIC X(256) .
000117 77 POW-0006 PIC X(256) .
000117 77 POW-0007 PIC X(256) .
000118 PROCEDURE   DIVISION.
000119******************************************************************
000120 MAIN                    SECTION.
000121******************************************************************
000122*
000123     MOVE  EX-RSVDATE  TO POW-0001.
000123     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVDATE101  BY
000123      REFERENCE POW-0001 .
000124     MOVE  EX-RSVSTAY  TO POW-0002.
000124     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVCNT101  BY
000124      REFERENCE POW-0002 .  
000125     MOVE  EX-RSVNUM  TO POW-0003.
000125     CALL  "_XPOWCWSETTEXT"  USING BY VALUE RSVNO101  BY
000125      REFERENCE POW-0003 .
000126     MOVE  EX-RSVROOM  TO POW-0004.
000126     CALL  "_XPOWCWSETTEXT"  USING BY VALUE ROOMNO101  BY
000126      REFERENCE POW-0004 .
000127     MOVE  EX-RSVTYPE  TO POW-0005.
000127     CALL  "_XPOWCWSETTEXT"  USING BY VALUE ROOMTYP101  BY
000127      REFERENCE POW-0005 .
000128     MOVE  EX-RSVNAME  TO POW-0006.
000128     CALL  "_XPOWCWSETTEXT"  USING BY VALUE CSTNAME101  BY
000128      REFERENCE POW-0006 .
000129     MOVE  EX-RSVTEL  TO POW-0007.
000129     CALL  "_XPOWCWSETTEXT"  USING BY VALUE CSTTEL101  BY
000129      REFERENCE POW-0007 .
000130*
000131 MAIN-EX.
000132     EXIT    PROGRAM.
000133 END PROGRAM "DEMO101-OPENED".
000134 IDENTIFICATION DIVISION.
000135 PROGRAM-ID. "DEMO101-START".
000136 PROCEDURE DIVISION.
000137     EXIT PROGRAM.
000138 END PROGRAM "DEMO101-START".
000139 IDENTIFICATION DIVISION.
000140 PROGRAM-ID. "CLOSE101-CLICK".
000141 ENVIRONMENT DIVISION.
000142 DATA        DIVISION.
000142 WORKING-STORAGE SECTION.
000143 PROCEDURE   DIVISION.
000144******************************************************************
000145 MAIN                    SECTION.
000146******************************************************************
000147*
000148     CALL    "_XPOWCSCLOSEMYSELF"  USING BY VALUE DEMO101 .
000149*
000150 MAIN-EX.
000151     EXIT    PROGRAM.        
000152 END PROGRAM "CLOSE101-CLICK".
000153 END PROGRAM "DEMO101".
