000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "HOTEL".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 FILE SECTION.
000010 WORKING-STORAGE SECTION.
000011******************************************************************
000012*        SHEET(ITEM) ===>    HOTEL
000013*        EVENT       ===>    WORKING
000014*                                1993.11.24 TOWA.SYSTEM.INC(NAKAI)
000015*                        UPDATE for ENGLISH 1994.10.24 K.IIZUKA
000016******************************************************************
000017*
000018 01  EX-AREA IS  GLOBAL  IS  EXTERNAL.
000019     03  RSV-INFORMATION.
000020         05  EX-RSVDATE      PIC X(10).
000021         05  EX-RSVNUM       PIC X(09).
000022         05  EX-RSVROOM      PIC X(04).
000023         05  EX-RSVTYPE      PIC X(02).
000024         05  EX-RSVNAME      PIC X(20).
000025         05  EX-RSVTEL       PIC X(12).
000026         05  EX-RSVSTAY      PIC X(02).
000027         05  EX-RSVTHIS      PIC X(09).
000028*
000029     03  MESSAGE-AREA.
000030         05  MSG-ERR         PIC X(80).
000031*
000032     03  SWITCH-AREA.
000033         05  RSV-SW          PIC X(02).
000034         05  SEL-SW          PIC 9(01).
000035*
000036     03  INDEX-AREA.
000037         05  DEL-IDX         PIC S9(04)  COMP-5.
000038         05  TBL-IDX         PIC S9(04)  COMP-5.
000039*
000040     03  ROOM-INFORMATION-LIST.
000041         05  TYPE-INFORMATION    OCCURS  7   TIMES.
000042             07  ROOM-TYPE-CODE  PIC X(02).
000043             07  ROOM-TYPE-NAME  PIC X(16).
000044             07  ROOM-TOTAL-NUM  PIC 9(04).
000045             07  ROOM-RSV-NUM    PIC 9(04).
000046*
000047     03  RSV-DATE-LIST.
000048         05  RSV-DATE    PIC X(10)   OCCURS  100 TIMES.
000049*
000050     03  RSV-NUM-LIST.
000051         05  RSV-NUM     PIC X(09)   OCCURS  100 TIMES
000052                                     INDEXED BY  RSVNO-IDX.
000053*
000054     03  RSV-ROOM-LIST.
000055         05  RSV-ROOM    PIC X(04)   OCCURS  100 TIMES
000056                                     INDEXED BY  RSV-IDX.
000057*
000058     03  ROOM-LIST.
000059         04  ROOM-TYPE-LIST.
000060             05  GUEST-ROOM-TYPE-TABLE   OCCURS  6   TIMES.
000061                 07  GUEST-ROOM          OCCURS  20  TIMES.
000062                     09  GUEST-ROOM-NUM  PIC X(04).
000063                     09  GUEST-ROOM-TYPE PIC X(02).
000064         04  ROOM-NUM-LIST   REDEFINES   ROOM-TYPE-LIST.
000065             05  ROOM-TABLE  OCCURS  120 INDEXED BY  ROOM-IDX.
000066                 07  ROOM-NUM        PIC X(04).
000067                 07  ROOM-TYPE       PIC X(02).  
000068*
000069     03  NAME-LIST.
000070         05  GUEST-NAME  PIC X(20)   OCCURS  100 TIMES
000071                                 INDEXED BY  NAME-IDX.
000072*
000073     03  TEL-LIST.
000074         05  TEL-NUM         PIC X(12)   OCCURS  100 TIMES
000075                                         INDEXED BY  TEL-IDX.
000076*
000077     03  STAY-LIST.
000078         05  STAY-NUM    PIC X(02)   OCCURS  100 TIMES
000079                                     INDEXED BY  CNT-IDX.
000080*
000081 01 POWER--HPOWOBJS-HOTEL IS GLOBAL IS EXTERNAL.
000082   02 POWER--HPOWOBJ--HOTEL.
000082     03 HOTEL PIC S9(9) COMP-5.
000082     03 POW-P001 REDEFINES  HOTEL USAGE POINTER.
000082   02 POWER--HPOWOBJ--IMAGE1.
000082     03 IMAGE1 PIC S9(9) COMP-5.
000082     03 POW-P002 REDEFINES  IMAGE1 USAGE POINTER.
000082   02 POWER--HPOWOBJ--PUSH1.
000082     03 PUSH1 PIC S9(9) COMP-5.
000082     03 POW-P003 REDEFINES  PUSH1 USAGE POINTER.
000082   02 POWER--HPOWOBJ--PUSH2.
000082     03 PUSH2 PIC S9(9) COMP-5.
000082     03 POW-P004 REDEFINES  PUSH2 USAGE POINTER.
000082   02 POWER--HPOWOBJ--LABEL2.
000082     03 LABEL2 PIC S9(9) COMP-5.
000082     03 POW-P005 REDEFINES  LABEL2 USAGE POINTER.
000082   02 POWER--HPOWOBJ--LABEL3.
000082     03 LABEL3 PIC S9(9) COMP-5.
000082     03 POW-P006 REDEFINES  LABEL3 USAGE POINTER.
000083 01  REDEFINES POWER--HPOWOBJS-HOTEL.
000084   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 6 TIMES.
000085******************************************************************
000086*        SHEET(ITEM)     :   HOTEL
000087*        EVENT           :   CONSTANT
000088******************************************************************
000089 01  CONST-ROOM-INFORMATION  IS  GLOBAL.
000090     03  ROOM-INFORMATION-DEF.
000091         05  FILLER  PIC X(02)   VALUE   "S1".
000092         05  FILLER  PIC X(16)   VALUE   "S1: SINGLE".
000093         05  FILLER  PIC 9(04)   VALUE   20.
000094         05  FILLER  PIC 9(04)   VALUE   11.
000095         05  FILLER  PIC X(02)   VALUE   "S2".
000096         05  FILLER  PIC X(16)   VALUE   "S2: SINGLE".
000097         05  FILLER  PIC 9(04)   VALUE   20.
000098         05  FILLER  PIC 9(04)   VALUE   4.
000099         05  FILLER  PIC X(02)   VALUE   "W".
000100         05  FILLER  PIC X(16)   VALUE   "W: DOUBLE".
000101         05  FILLER  PIC 9(04)   VALUE   20.
000102         05  FILLER  PIC 9(04)   VALUE   4.
000103         05  FILLER  PIC X(02)   VALUE   "T1".
000104         05  FILLER  PIC X(16)   VALUE   "T1: TWIN".
000105         05  FILLER  PIC 9(04)   VALUE   10.
000106         05  FILLER  PIC 9(04)   VALUE   0.
000107         05  FILLER  PIC X(02)   VALUE   "T2".
000108         05  FILLER  PIC X(16)   VALUE   "T2: TWIN".
000109         05  FILLER  PIC 9(04)   VALUE   10.
000110         05  FILLER  PIC 9(04)   VALUE   0.
000111         05  FILLER  PIC X(02)   VALUE   "SU".
000112         05  FILLER  PIC X(16)   VALUE   "SU: SUIT".
000113         05  FILLER  PIC 9(04)   VALUE   10.
000114         05  FILLER  PIC 9(04)   VALUE   2.
000115         05  FILLER  PIC X(02)   VALUE   "KE".
000116         05  FILLER  PIC X(16)   VALUE   "*** TOTAL ***".
000117         05  FILLER  PIC 9(04)   VALUE   100.
000118         05  FILLER  PIC 9(04)   VALUE   21.
000119*
000120 01  CONST-RSV-DATE  IS  GLOBAL.
000121     02  RSV-DATE-DEF.
000122         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000123         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000124         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000125         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000126         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000127         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000128         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000129         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000130         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000131         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000132         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000133         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000134         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000135         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000136         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000137         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000138         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000139         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000140         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000141         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000142         03  FILLER      PIC X(10)   VALUE   IS  "1994/11/21".
000143
000144
000145 01  CONST-RSV-NUM       IS  GLOBAL.
000146     02  RSV-NUM-DEF.
000147         03  FILLER      PIC X(09)   VALUE   IS  "1111-0001".
000148         03  FILLER      PIC X(09)   VALUE   IS  "1111-0002".
000149         03  FILLER      PIC X(09)   VALUE   IS  "1111-0003".
000150         03  FILLER      PIC X(09)   VALUE   IS  "1111-0004".
000151         03  FILLER      PIC X(09)   VALUE   IS  "1111-0005".
000152         03  FILLER      PIC X(09)   VALUE   IS  "1111-0006".
000153         03  FILLER      PIC X(09)   VALUE   IS  "1111-0007".
000154         03  FILLER      PIC X(09)   VALUE   IS  "1111-0008".
000155         03  FILLER      PIC X(09)   VALUE   IS  "1111-0009".
000156         03  FILLER      PIC X(09)   VALUE   IS  "1111-0010".
000157         03  FILLER      PIC X(09)   VALUE   IS  "1111-0011".
000158         03  FILLER      PIC X(09)   VALUE   IS  "1111-0012".
000159         03  FILLER      PIC X(09)   VALUE   IS  "1111-0013".
000160         03  FILLER      PIC X(09)   VALUE   IS  "1111-0014".
000161         03  FILLER      PIC X(09)   VALUE   IS  "1111-0015".
000162         03  FILLER      PIC X(09)   VALUE   IS  "1111-0016".
000163         03  FILLER      PIC X(09)   VALUE   IS  "1111-0017".
000164         03  FILLER      PIC X(09)   VALUE   IS  "1111-0018".
000165         03  FILLER      PIC X(09)   VALUE   IS  "1111-0019".
000166         03  FILLER      PIC X(09)   VALUE   IS  "1111-0020".
000167         03  FILLER      PIC X(09)   VALUE   IS  "1111-0021".
000168         
000169 01  CONST-RSV-ROOM  IS  GLOBAL.
000170     02  RSV-ROOM-DEF.
000171         03  FILLER      PIC X(04)   VALUE   IS  "0201".
000172         03  FILLER      PIC X(04)   VALUE   IS  "0202".
000173         03  FILLER      PIC X(04)   VALUE   IS  "0203".
000174         03  FILLER      PIC X(04)   VALUE   IS  "0204".
000175         03  FILLER      PIC X(04)   VALUE   IS  "0215".
000176         03  FILLER      PIC X(04)   VALUE   IS  "0300".
000177         03  FILLER      PIC X(04)   VALUE   IS  "0251".
000178         03  FILLER      PIC X(04)   VALUE   IS  "0252".
000179         03  FILLER      PIC X(04)   VALUE   IS  "0221".
000180         03  FILLER      PIC X(04)   VALUE   IS  "0222".
000181         03  FILLER      PIC X(04)   VALUE   IS  "0211".
000182         03  FILLER      PIC X(04)   VALUE   IS  "0212".
000183         03  FILLER      PIC X(04)   VALUE   IS  "0213".
000184         03  FILLER      PIC X(04)   VALUE   IS  "0214".
000185         03  FILLER      PIC X(04)   VALUE   IS  "0206".
000186         03  FILLER      PIC X(04)   VALUE   IS  "0299".
000187         03  FILLER      PIC X(04)   VALUE   IS  "0252".
000188         03  FILLER      PIC X(04)   VALUE   IS  "0254".
000189         03  FILLER      PIC X(04)   VALUE   IS  "0223".
000190         03  FILLER      PIC X(04)   VALUE   IS  "0224".
000191         03  FILLER      PIC X(04)   VALUE   IS  "0207".
000192*
000193 01  CONST-NAME  IS  GLOBAL.
000194     02  NAME-DEF.
000195         03  FILLER  PIC X(20)   VALUE   IS  "EMI.WAKUI".
000196         03  FILLER  PIC X(20)   VALUE   IS  "AKINA.NAKAMORI".
000197         03  FILLER  PIC X(20)   VALUE   IS  "NOBUNAGA.ODA".
000198         03  FILLER  PIC X(20)   VALUE   IS  "IEYASU.TOKUGAWA".
000199         03  FILLER  PIC X(20)   VALUE   IS  "HIDEYOSHI.TOYOTOMI".
000200         03  FILLER  PIC X(20)   VALUE   IS  "SHOTOKU.TAISHI".
000201         03  FILLER  PIC X(20)   VALUE   IS  "HIROBUMI.ITOH".
000202         03  FILLER  PIC X(20)   VALUE   IS  "SOHSEKI.NATSUME".
000203         03  FILLER  PIC X(20)   VALUE   IS  "SHIGENOBU.OHKUMA".
000204         03  FILLER  PIC X(20)   VALUE   IS  "TAKESHI.KITANO".
000205         03  FILLER  PIC X(20)   VALUE   IS  "EMI.WAKUI".
000206         03  FILLER  PIC X(20)   VALUE   IS  "AKINA.NAKAMORI".
000207         03  FILLER  PIC X(20)   VALUE   IS  "NOBUNAGA.ODA".
000208         03  FILLER  PIC X(20)   VALUE   IS  "IEYASU.TOKUGAWA".
000209         03  FILLER  PIC X(20)   VALUE   IS  "HIDEYOSHI.TOYOTOMI".
000210         03  FILLER  PIC X(20)   VALUE   IS  "SHOTOKU.TAISHI".
000211         03  FILLER  PIC X(20)   VALUE   IS  "HIROBUMI.ITOH".
000212         03  FILLER  PIC X(20)   VALUE   IS  "SOHSEKI.NATSUME".
000213         03  FILLER  PIC X(20)   VALUE   IS  "SHIGENOBU.OHKUMA".
000214         03  FILLER  PIC X(20)   VALUE   IS  "TAKESHI.KITANO".
000215*
000216 01  CONST-TEL   IS  GLOBAL.
000217     02  TEL-DEF.
000218         03  FILLER      PIC X(12)   VALUE   IS  "03-1234-1234".
000219         03  FILLER      PIC X(12)   VALUE   IS  "052-111-2222".
000220         03  FILLER      PIC X(12)   VALUE   IS  "0562-22-3333".
000221         03  FILLER      PIC X(12)   VALUE   IS  "0567-33-4455".
000222         03  FILLER      PIC X(12)   VALUE   IS  "052-987-6543".
000223         03  FILLER      PIC X(12)   VALUE   IS  "052-212-3456".
000224         03  FILLER      PIC X(12)   VALUE   IS  "052-555-7777".
000225         03  FILLER      PIC X(12)   VALUE   IS  "03-5512-3456".
000226         03  FILLER      PIC X(12)   VALUE   IS  "03-5641-6125".
000227         03  FILLER      PIC X(12)   VALUE   IS  "052-454-4568".
000228         03  FILLER      PIC X(12)   VALUE   IS  "03-1234-1234".
000229         03  FILLER      PIC X(12)   VALUE   IS  "052-111-2222".
000230         03  FILLER      PIC X(12)   VALUE   IS  "0562-22-3333".
000231         03  FILLER      PIC X(12)   VALUE   IS  "0567-33-4455".
000232         03  FILLER      PIC X(12)   VALUE   IS  "052-987-6543".
000233         03  FILLER      PIC X(12)   VALUE   IS  "052-212-3456".
000234         03  FILLER      PIC X(12)   VALUE   IS  "052-555-7777".
000235         03  FILLER      PIC X(12)   VALUE   IS  "03-5512-3456".
000236         03  FILLER      PIC X(12)   VALUE   IS  "03-5641-6125".
000237         03  FILLER      PIC X(12)   VALUE   IS  "052-454-4568".
000238         03  FILLER      PIC X(12)   VALUE   IS  "052-454-4568".
000239*
000240 01  CONST-STAY  IS  GLOBAL.
000241     02  STAY-DEF.
000242         03  FILLER      PIC X(02)   VALUE   IS  "01".
000243         03  FILLER      PIC X(02)   VALUE   IS  "02".
000244         03  FILLER      PIC X(02)   VALUE   IS  "03".
000245         03  FILLER      PIC X(02)   VALUE   IS  "02".
000246         03  FILLER      PIC X(02)   VALUE   IS  "02".
000247         03  FILLER      PIC X(02)   VALUE   IS  "01".
000248         03  FILLER      PIC X(02)   VALUE   IS  "06".
000249         03  FILLER      PIC X(02)   VALUE   IS  "08".
000250         03  FILLER      PIC X(02)   VALUE   IS  "10".
000251         03  FILLER      PIC X(02)   VALUE   IS  "02".
000252         03  FILLER      PIC X(02)   VALUE   IS  "01".
000253         03  FILLER      PIC X(02)   VALUE   IS  "02".
000254         03  FILLER      PIC X(02)   VALUE   IS  "03".
000255         03  FILLER      PIC X(02)   VALUE   IS  "02".
000256         03  FILLER      PIC X(02)   VALUE   IS  "02".
000257         03  FILLER      PIC X(02)   VALUE   IS  "01".
000258         03  FILLER      PIC X(02)   VALUE   IS  "06".
000259         03  FILLER      PIC X(02)   VALUE   IS  "08".
000260         03  FILLER      PIC X(02)   VALUE   IS  "10".
000261         03  FILLER      PIC X(02)   VALUE   IS  "02".
000262         03  FILLER      PIC X(02)   VALUE   IS  "02".
000263*
000264****     MASTER TABLE
000265*
000266 01  CONST-ROOM  IS  GLOBAL.
000267     02  ROOM-DEF.
000268         03  FILLER      PIC X(06)   VALUE   IS  "0201S1".
000269         03  FILLER      PIC X(06)   VALUE   IS  "0202S1".
000270         03  FILLER      PIC X(06)   VALUE   IS  "0203S1".
000271         03  FILLER      PIC X(06)   VALUE   IS  "0204S1".
000272         03  FILLER      PIC X(06)   VALUE   IS  "0205S1".
000273         03  FILLER      PIC X(06)   VALUE   IS  "0206S1".
000274         03  FILLER      PIC X(06)   VALUE   IS  "0207S1".
000275         03  FILLER      PIC X(06)   VALUE   IS  "0208S1".
000276         03  FILLER      PIC X(06)   VALUE   IS  "0209S1".
000277         03  FILLER      PIC X(06)   VALUE   IS  "0210S1".
000278         03  FILLER      PIC X(06)   VALUE   IS  "0211S1".
000279         03  FILLER      PIC X(06)   VALUE   IS  "0212S1".
000280         03  FILLER      PIC X(06)   VALUE   IS  "0213S1".
000281         03  FILLER      PIC X(06)   VALUE   IS  "0214S1".
000282         03  FILLER      PIC X(06)   VALUE   IS  "0215S1".
000283         03  FILLER      PIC X(06)   VALUE   IS  "0216S1".
000284         03  FILLER      PIC X(06)   VALUE   IS  "0217S1".
000285         03  FILLER      PIC X(06)   VALUE   IS  "0218S1".
000286         03  FILLER      PIC X(06)   VALUE   IS  "0219S1".
000287         03  FILLER      PIC X(06)   VALUE   IS  "0220S1".
000288* 
000289         03  FILLER      PIC X(06)   VALUE   IS  "0221S2".
000290         03  FILLER      PIC X(06)   VALUE   IS  "0222S2".
000291         03  FILLER      PIC X(06)   VALUE   IS  "0223S2".
000292         03  FILLER      PIC X(06)   VALUE   IS  "0224S2".
000293         03  FILLER      PIC X(06)   VALUE   IS  "0225S2".
000294         03  FILLER      PIC X(06)   VALUE   IS  "0226S2".
000295         03  FILLER      PIC X(06)   VALUE   IS  "0227S2".
000296         03  FILLER      PIC X(06)   VALUE   IS  "0228S2".
000297         03  FILLER      PIC X(06)   VALUE   IS  "0229S2".
000298         03  FILLER      PIC X(06)   VALUE   IS  "0230S2".
000299         03  FILLER      PIC X(06)   VALUE   IS  "0231S2".
000300         03  FILLER      PIC X(06)   VALUE   IS  "0232S2".
000301         03  FILLER      PIC X(06)   VALUE   IS  "0233S2".
000302         03  FILLER      PIC X(06)   VALUE   IS  "0234S2".
000303         03  FILLER      PIC X(06)   VALUE   IS  "0235S2".
000304         03  FILLER      PIC X(06)   VALUE   IS  "0236S2".
000305         03  FILLER      PIC X(06)   VALUE   IS  "0237S2".
000306         03  FILLER      PIC X(06)   VALUE   IS  "0238S2".
000307         03  FILLER      PIC X(06)   VALUE   IS  "0239S2".
000308         03  FILLER      PIC X(06)   VALUE   IS  "0240S2".
000309* 
000310         03  FILLER      PIC X(06)   VALUE   IS  "0241W".
000311         03  FILLER      PIC X(06)   VALUE   IS  "0242W".
000312         03  FILLER      PIC X(06)   VALUE   IS  "0243W".
000313         03  FILLER      PIC X(06)   VALUE   IS  "0244W".
000314         03  FILLER      PIC X(06)   VALUE   IS  "0245W".
000315         03  FILLER      PIC X(06)   VALUE   IS  "0246W".
000316         03  FILLER      PIC X(06)   VALUE   IS  "0247W".
000317         03  FILLER      PIC X(06)   VALUE   IS  "0248W".
000318         03  FILLER      PIC X(06)   VALUE   IS  "0249W".
000319         03  FILLER      PIC X(06)   VALUE   IS  "0250W".
000320         03  FILLER      PIC X(06)   VALUE   IS  "0251W".
000321         03  FILLER      PIC X(06)   VALUE   IS  "0252W".
000322         03  FILLER      PIC X(06)   VALUE   IS  "0253W".
000323         03  FILLER      PIC X(06)   VALUE   IS  "0254W".
000324         03  FILLER      PIC X(06)   VALUE   IS  "0255W".
000325         03  FILLER      PIC X(06)   VALUE   IS  "0256W".
000326         03  FILLER      PIC X(06)   VALUE   IS  "0257W".
000327         03  FILLER      PIC X(06)   VALUE   IS  "0258W".
000328         03  FILLER      PIC X(06)   VALUE   IS  "0259W".
000329         03  FILLER      PIC X(06)   VALUE   IS  "0260W".
000330*
000331         03  FILLER      PIC X(06)   VALUE   IS  "0261T1".
000332         03  FILLER      PIC X(06)   VALUE   IS  "0262T1".
000333         03  FILLER      PIC X(06)   VALUE   IS  "0263T1".
000334         03  FILLER      PIC X(06)   VALUE   IS  "0264T1".
000335         03  FILLER      PIC X(06)   VALUE   IS  "0265T1".
000336         03  FILLER      PIC X(06)   VALUE   IS  "0266T1".
000337         03  FILLER      PIC X(06)   VALUE   IS  "0267T1".
000338         03  FILLER      PIC X(06)   VALUE   IS  "0268T1".
000339         03  FILLER      PIC X(06)   VALUE   IS  "0269T1".
000340         03  FILLER      PIC X(06)   VALUE   IS  "0270T1".
000341         03  FILLER      PIC X(06)   VALUE   IS  "0271T1".
000342         03  FILLER      PIC X(06)   VALUE   IS  "0272T1".
000343         03  FILLER      PIC X(06)   VALUE   IS  "0273T1".
000344         03  FILLER      PIC X(06)   VALUE   IS  "0274T1".
000345         03  FILLER      PIC X(06)   VALUE   IS  "0275T1".
000346         03  FILLER      PIC X(06)   VALUE   IS  "0276T1".
000347         03  FILLER      PIC X(06)   VALUE   IS  "0277T1".
000348         03  FILLER      PIC X(06)   VALUE   IS  "0278T1".
000349         03  FILLER      PIC X(06)   VALUE   IS  "0279T1".
000350         03  FILLER      PIC X(06)   VALUE   IS  "0280T1".
000351*
000352         03  FILLER      PIC X(06)   VALUE   IS  "0281T2".
000353         03  FILLER      PIC X(06)   VALUE   IS  "0282T2".
000354         03  FILLER      PIC X(06)   VALUE   IS  "0283T2".
000355         03  FILLER      PIC X(06)   VALUE   IS  "0284T2".
000356         03  FILLER      PIC X(06)   VALUE   IS  "0285T2".
000357         03  FILLER      PIC X(06)   VALUE   IS  "0286T2".
000358         03  FILLER      PIC X(06)   VALUE   IS  "0287T2".
000359         03  FILLER      PIC X(06)   VALUE   IS  "0288T2".
000360         03  FILLER      PIC X(06)   VALUE   IS  "0289T2".
000361         03  FILLER      PIC X(06)   VALUE   IS  "0290T2".
000362         03  FILLER      PIC X(60)   VALUE   IS  SPACE.
000363*
000364         03  FILLER      PIC X(06)   VALUE   IS  "0291SU".
000365         03  FILLER      PIC X(06)   VALUE   IS  "0292SU".
000366         03  FILLER      PIC X(06)   VALUE   IS  "0293SU".
000367         03  FILLER      PIC X(06)   VALUE   IS  "0294SU".
000368         03  FILLER      PIC X(06)   VALUE   IS  "0295SU".
000369         03  FILLER      PIC X(06)   VALUE   IS  "0296SU".
000370         03  FILLER      PIC X(06)   VALUE   IS  "0297SU".
000371         03  FILLER      PIC X(06)   VALUE   IS  "0298SU".
000372         03  FILLER      PIC X(06)   VALUE   IS  "0299SU".
000373         03  FILLER      PIC X(06)   VALUE   IS  "0300SU".
000374         03  FILLER      PIC X(06)   VALUE   IS  "0301SU".
000375         03  FILLER      PIC X(06)   VALUE   IS  "0302SU".
000376         03  FILLER      PIC X(06)   VALUE   IS  "0303SU".
000377         03  FILLER      PIC X(06)   VALUE   IS  "0304SU".
000378         03  FILLER      PIC X(06)   VALUE   IS  "0305SU".
000379         03  FILLER      PIC X(06)   VALUE   IS  "0306SU".
000380         03  FILLER      PIC X(06)   VALUE   IS  "0307SU".
000381         03  FILLER      PIC X(06)   VALUE   IS  "0308SU".
000382         03  FILLER      PIC X(06)   VALUE   IS  "0309SU".
000383         03  FILLER      PIC X(06)   VALUE   IS  "0310SU".
000384*
000385 LOCAL-STORAGE SECTION.
000386 LINKAGE SECTION.
000387 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000388 01  POWER--ID      IS GLOBAL PICTURE IS S9(4)
000389                    USAGE IS COMPUTATIONAL-5.
000390 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(4)
000391                    USAGE IS COMPUTATIONAL-5.
000392 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(4)
000393                    USAGE IS COMPUTATIONAL-5.
000394 PROCEDURE DIVISION
000395     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000396     EVALUATE POWER--MESSAGE
000397     WHEN 1025
000398         EVALUATE POWER--HPOWOBJ
000399         WHEN POWER--HPOWOBJ--PUSH1
000400             EVALUATE POWER--NOTIFY
000401             WHEN 1 
000402                CALL "PUSH1-CLICK"
000403             END-EVALUATE
000404         WHEN POWER--HPOWOBJ--PUSH2
000405             EVALUATE POWER--NOTIFY
000406             WHEN 1 
000407                CALL "PUSH2-CLICK"
000408             END-EVALUATE
000409         END-EVALUATE
000410     WHEN 1024
000411         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000412     WHEN 1036
000413         CALL "HOTEL-OPENED"
000414     WHEN 1038
000415         CALL "HOTEL-START"
000416     END-EVALUATE
000417     EXIT PROGRAM.
000418 IDENTIFICATION DIVISION.
000419 PROGRAM-ID. "HOTEL-OPENED".
000420 ENVIRONMENT DIVISION.
000421 DATA        DIVISION.
000422 PROCEDURE   DIVISION.
000423 MAIN                    SECTION.
000424*
000425***  INIT DATA ***
000426*
000427     MOVE    ROOM-INFORMATION-DEF    TO  ROOM-INFORMATION-LIST.
000428     MOVE    RSV-DATE-DEF            TO  RSV-DATE-LIST.
000429     MOVE    RSV-NUM-DEF             TO  RSV-NUM-LIST.
000430     MOVE    RSV-ROOM-DEF            TO  RSV-ROOM-LIST.
000431     MOVE    NAME-DEF                TO  NAME-LIST.
000432     MOVE    TEL-DEF                 TO  TEL-LIST.
000433     MOVE    STAY-DEF                TO  STAY-LIST.
000434     MOVE    ROOM-DEF                TO  ROOM-LIST.
000435*
000436 MAIN-EX.
000437     EXIT    PROGRAM.
000438 END PROGRAM "HOTEL-OPENED".
000439 IDENTIFICATION DIVISION.
000440 PROGRAM-ID. "HOTEL-START".
000441 PROCEDURE DIVISION.
000442     EXIT PROGRAM.
000443 END PROGRAM "HOTEL-START".
000444 IDENTIFICATION DIVISION.
000445 PROGRAM-ID. "PUSH1-CLICK".
000446 ENVIRONMENT DIVISION.
000447 DATA        DIVISION.
000447 WORKING-STORAGE SECTION.
000447 77 POW-0001 PIC X(14) .
000448 PROCEDURE   DIVISION.
000449******************************************************************
000450 MAIN                    SECTION.
000451******************************************************************
000452*
000453      MOVE  "DEMO001"  TO POW-0001.
000453      CALL "_XPOWCSOPENSHEET"  USING BY VALUE HOTEL
000453       BY REFERENCE POW-0001 .
000454*
000455 MAIN-EX.
000456     EXIT    PROGRAM.
000457 END PROGRAM "PUSH1-CLICK".
000458 IDENTIFICATION DIVISION.
000459 PROGRAM-ID. "PUSH2-CLICK".
000460 ENVIRONMENT DIVISION.
000461 DATA        DIVISION.
000461 WORKING-STORAGE SECTION.
000461 77 POW-0001 PIC X(14) .
000462 PROCEDURE   DIVISION.
000463******************************************************************
000464 MAIN                    SECTION.
000465******************************************************************
000466*
000467      MOVE  "HOTEL"  TO POW-0001.
000467      CALL "_XPOWCSCLOSESHEET"  USING BY VALUE HOTEL
000467       BY REFERENCE POW-0001 .
000468*
000469 MAIN-EX.
000470     EXIT    PROGRAM.
000471 END PROGRAM "PUSH2-CLICK".
000472 END PROGRAM "HOTEL".
