000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. "COBOLREG".
000003 ENVIRONMENT DIVISION.
000004 CONFIGURATION SECTION.
000005 SPECIAL-NAMES.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008 DATA DIVISION.
000009 BASED-STORAGE SECTION.
000010 FILE SECTION.
000011 WORKING-STORAGE SECTION.
000012 01 POWER--HPOWOBJS-COBOLREG IS GLOBAL IS EXTERNAL.
000013   02 POWER--HPOWOBJ--COBOLREG.
000013     03 COBOLREG PIC S9(9) COMP-5.
000013     03 POW-P001 REDEFINES  COBOLREG USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-TITLE.
000013     03 TX-TITLE PIC S9(9) COMP-5.
000013     03 POW-P002 REDEFINES  TX-TITLE USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-START-HEAD.
000013     03 TX-START-HEAD PIC S9(9) COMP-5.
000013     03 POW-P003 REDEFINES  TX-START-HEAD USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-END-HEAD.
000013     03 TX-END-HEAD PIC S9(9) COMP-5.
000013     03 POW-P004 REDEFINES  TX-END-HEAD USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-RANGE-TITLE.
000013     03 TX-RANGE-TITLE PIC S9(9) COMP-5.
000013     03 POW-P005 REDEFINES  TX-RANGE-TITLE USAGE POINTER.
000013   02 POWER--HPOWOBJ--RADIO-FRSTNAM.
000013     03 RADIO-FRSTNAM PIC S9(9) COMP-5.
000013     03 POW-P006 REDEFINES  RADIO-FRSTNAM USAGE POINTER.
000013   02 POWER--HPOWOBJ--RADIO-LASTNAM.
000013     03 RADIO-LASTNAM PIC S9(9) COMP-5.
000013     03 POW-P007 REDEFINES  RADIO-LASTNAM USAGE POINTER.
000013   02 POWER--HPOWOBJ--RADIO-REGNO.
000013     03 RADIO-REGNO PIC S9(9) COMP-5.
000013     03 POW-P008 REDEFINES  RADIO-REGNO USAGE POINTER.
000013   02 POWER--HPOWOBJ--RADIO-SERNO.
000013     03 RADIO-SERNO PIC S9(9) COMP-5.
000013     03 POW-P009 REDEFINES  RADIO-SERNO USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-FRSTNM-STRT.
000013     03 ED-FRSTNM-STRT PIC S9(9) COMP-5.
000013     03 POW-P010 REDEFINES  ED-FRSTNM-STRT USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL4.
000013     03 LABEL4 PIC S9(9) COMP-5.
000013     03 POW-P011 REDEFINES  LABEL4 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-FRSTNM-END.
000013     03 ED-FRSTNM-END PIC S9(9) COMP-5.
000013     03 POW-P012 REDEFINES  ED-FRSTNM-END USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-LASTNM-STRT.
000013     03 ED-LASTNM-STRT PIC S9(9) COMP-5.
000013     03 POW-P013 REDEFINES  ED-LASTNM-STRT USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL5.
000013     03 LABEL5 PIC S9(9) COMP-5.
000013     03 POW-P014 REDEFINES  LABEL5 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-LASTNM-END.
000013     03 ED-LASTNM-END PIC S9(9) COMP-5.
000013     03 POW-P015 REDEFINES  ED-LASTNM-END USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-REGID-STRT.
000013     03 ED-REGID-STRT PIC S9(9) COMP-5.
000013     03 POW-P016 REDEFINES  ED-REGID-STRT USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL6.
000013     03 LABEL6 PIC S9(9) COMP-5.
000013     03 POW-P017 REDEFINES  LABEL6 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-REGID-END.
000013     03 ED-REGID-END PIC S9(9) COMP-5.
000013     03 POW-P018 REDEFINES  ED-REGID-END USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-SERNO-STRT.
000013     03 ED-SERNO-STRT PIC S9(9) COMP-5.
000013     03 POW-P019 REDEFINES  ED-SERNO-STRT USAGE POINTER.
000013   02 POWER--HPOWOBJ--LABEL7.
000013     03 LABEL7 PIC S9(9) COMP-5.
000013     03 POW-P020 REDEFINES  LABEL7 USAGE POINTER.
000013   02 POWER--HPOWOBJ--ED-SERNO-END.
000013     03 ED-SERNO-END PIC S9(9) COMP-5.
000013     03 POW-P021 REDEFINES  ED-SERNO-END USAGE POINTER.
000013   02 POWER--HPOWOBJ--BUTTON-CANCEL.
000013     03 BUTTON-CANCEL PIC S9(9) COMP-5.
000013     03 POW-P022 REDEFINES  BUTTON-CANCEL USAGE POINTER.
000013   02 POWER--HPOWOBJ--BUTTON-PRINT.
000013     03 BUTTON-PRINT PIC S9(9) COMP-5.
000013     03 POW-P023 REDEFINES  BUTTON-PRINT USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-RGID-S-ERR.
000013     03 TX-RGID-S-ERR PIC S9(9) COMP-5.
000013     03 POW-P024 REDEFINES  TX-RGID-S-ERR USAGE POINTER.
000013   02 POWER--HPOWOBJ--TX-RGID-E-ERR.
000013     03 TX-RGID-E-ERR PIC S9(9) COMP-5.
000013     03 POW-P025 REDEFINES  TX-RGID-E-ERR USAGE POINTER.
000013   02 POWER--HPOWOBJ--DEMO-DESCRIP.
000013     03 DEMO-DESCRIP PIC S9(9) COMP-5.
000013     03 POW-P026 REDEFINES  DEMO-DESCRIP USAGE POINTER.
000014 01  REDEFINES POWER--HPOWOBJS-COBOLREG.
000015   02  POWER--HPOWOBJS PICTURE IS X(4) OCCURS 26 TIMES.
000016 01  POWER-HPOWOBJIDX PIC S9(9) COMP-5.
000017  01  REPORT-REQUEST GLOBAL.
000018      COPY "REPORT-REQUEST.CBL".
000019
000020  01  REG-ID-STATUS  GLOBAL PIC 99 COMP.
000021     88  REG-ID-NO-ERROR-DISPLAYED      VALUE 0.
000022     88  REG-ID-ST-ERROR-DISPLAYED      VALUE 1.
000023     88  REG-ID-ST-NON-NUMERIC          VALUE 2.
000024     88  REG-ID-EN-ERROR-DISPLAYED      VALUE 3.
000025     88  REG-ID-EN-NON-NUMERIC          VALUE 4.
000026 
000027 CONSTANT SECTION.
000028 COPY "Registration-Constants.CBL".
000029 LINKAGE SECTION.
000030 01  POWER--HPOWOBJ IS GLOBAL PICTURE IS  X(4).
000031 01  POWER--ID      IS GLOBAL PICTURE IS S9(9)
000032                    USAGE IS COMPUTATIONAL-5.
000033 01  POWER--NOTIFY  IS GLOBAL PICTURE IS S9(9)
000034                    USAGE IS COMPUTATIONAL-5.
000035 01  POWER--MESSAGE IS GLOBAL PICTURE IS S9(9)
000036                    USAGE IS COMPUTATIONAL-5.
000037 PROCEDURE DIVISION
000038     USING POWER--HPOWOBJ POWER--ID POWER--MESSAGE POWER--NOTIFY.
000039     EVALUATE POWER--MESSAGE
000040     WHEN 1025
000041         EVALUATE POWER--HPOWOBJ
000042         WHEN POWER--HPOWOBJ--RADIO-FRSTNAM
000043             EVALUATE POWER--NOTIFY
000044             WHEN 1 
000045                CALL "RADIO-FRSTNAM-CLICK"
000046             END-EVALUATE
000047         WHEN POWER--HPOWOBJ--RADIO-LASTNAM
000048             EVALUATE POWER--NOTIFY
000049             WHEN 1 
000050                CALL "RADIO-LASTNAM-CLICK"
000051             END-EVALUATE
000052         WHEN POWER--HPOWOBJ--RADIO-REGNO
000053             EVALUATE POWER--NOTIFY
000054             WHEN 1 
000055                CALL "RADIO-REGNO-CLICK"
000056             END-EVALUATE
000057         WHEN POWER--HPOWOBJ--RADIO-SERNO
000058             EVALUATE POWER--NOTIFY
000059             WHEN 1 
000060                CALL "RADIO-SERNO-CLICK"
000061             END-EVALUATE
000062         WHEN POWER--HPOWOBJ--BUTTON-CANCEL
000063             EVALUATE POWER--NOTIFY
000064             WHEN 1 
000065                CALL "BUTTON-CANCEL-CLICK"
000066             END-EVALUATE
000067         WHEN POWER--HPOWOBJ--BUTTON-PRINT
000068             EVALUATE POWER--NOTIFY
000069             WHEN 1 
000070                CALL "BUTTON-PRINT-CLICK"
000071             END-EVALUATE
000072         WHEN POWER--HPOWOBJ--ED-FRSTNM-STRT
000073             EVALUATE POWER--NOTIFY
000074             WHEN 7 
000075                CALL "ED-FRSTNM-STRT-CHANGE"
000076             WHEN 27 
000077                CALL "ED-FRSTNM-STRT-RETURN"
000078             END-EVALUATE
000079         WHEN POWER--HPOWOBJ--ED-FRSTNM-END
000080             EVALUATE POWER--NOTIFY
000081             WHEN 27 
000082                CALL "ED-FRSTNM-END-RETURN"
000083             END-EVALUATE
000084         WHEN POWER--HPOWOBJ--ED-LASTNM-STRT
000085             EVALUATE POWER--NOTIFY
000086             WHEN 27 
000087                CALL "ED-LASTNM-STRT-RETURN"
000088             END-EVALUATE
000089         WHEN POWER--HPOWOBJ--ED-LASTNM-END
000090             EVALUATE POWER--NOTIFY
000091             WHEN 27 
000092                CALL "ED-LASTNM-END-RETURN"
000093             END-EVALUATE
000094         WHEN POWER--HPOWOBJ--ED-REGID-STRT
000095             EVALUATE POWER--NOTIFY
000096             WHEN 7 
000097                CALL "ED-REGID-STRT-CHANGE"
000098             WHEN 26 
000099                CALL "ED-REGID-STRT-EDIT"
000100             WHEN 27 
000101                CALL "ED-REGID-STRT-RETURN"
000102             END-EVALUATE
000103         WHEN POWER--HPOWOBJ--ED-REGID-END
000104             EVALUATE POWER--NOTIFY
000105             WHEN 7 
000106                CALL "ED-REGID-END-CHANGE"
000107             WHEN 26 
000108                CALL "ED-REGID-END-EDIT"
000109             WHEN 27 
000110                CALL "ED-REGID-END-RETURN"
000111             END-EVALUATE
000112         WHEN POWER--HPOWOBJ--ED-SERNO-STRT
000113             EVALUATE POWER--NOTIFY
000114             WHEN 27 
000115                CALL "ED-SERNO-STRT-RETURN"
000116             END-EVALUATE
000117         WHEN POWER--HPOWOBJ--ED-SERNO-END
000118             EVALUATE POWER--NOTIFY
000119             WHEN 27 
000120                CALL "ED-SERNO-END-RETURN"
000121             END-EVALUATE
000122         WHEN POWER--HPOWOBJ--DEMO-DESCRIP
000123             EVALUATE POWER--NOTIFY
000124             WHEN 1 
000125                CALL "DEMO-DESCRIP-CLICK"
000126             END-EVALUATE
000127         END-EVALUATE
000128     WHEN 1024
000129         MOVE POWER--HPOWOBJ TO POWER--HPOWOBJS (POWER--ID + 1)
000130     WHEN 1036
000131         CALL "COBOLREG-OPENED"
000132     WHEN 1038
000133         CALL "COBOLREG-START"
000134     END-EVALUATE
000135     EXIT PROGRAM.
000136 IDENTIFICATION DIVISION.
000137 PROGRAM-ID. "INVOKE-PRINT" COMMON.
000138
000139* Code to do final checks on input data and
000140*  invoke the report program (Print-Registrations)
000141
000142 ENVIRONMENT DIVISION.
000143 DATA DIVISION.
000144 WORKING-STORAGE SECTION.
000145* Record Definition for REPORT-REQUEST passed to the 
000146*  print program is declared as GLOBAL in the 
000147*  WORKING-STORAGE of the COBOLREG sheet.
000148
000149 01 WK-AREA.
000150   03  WK-NUM                PIC 9(9).
000151   03                        PIC X(247).
000152
000153 01 WK-POINTER               PIC 9(4) COMP.
000154 01 WK-POINTER-2             PIC 9(4) COMP.
000155 
000156
000157 01 ERROR-MESSAGE-TEXTS.
000158   03 PIC X(128) VALUE "Invalid key error. Check ""Start at"" val
000159-                      "ue.".
000160   03 PIC X(128) VALUE "System error - invalid request code.".
000161   03 PIC X(128) VALUE "No records found in registration file equ
000162-                      "al to, or greater than, ""Start at"" valu
000163-                      "e.".
000164   03 PIC X(128) VALUE "No records found in specified range.".
000165   03 PIC X(128) VALUE "Failed to open registration file.".
000166   03 PIC X(128) VALUE "Unable to call print routine. If another 
000167-                      "report is printing, try clicking Print w
000168-                      "hen that report is finished.".
000169   03 PIC X(128) VALUE """Start at"" value is greater than ""End
000170-                      " at"" value.".
000171
000172 01 ERROR-MESSAGE-TABLE REDEFINES ERROR-MESSAGE-TEXTS.
000173   03 ERROR-MESSAGE OCCURS 7 PIC X(128).
000174
000175 01 MB-MESSAGE               PIC X(256).
000176
000177 01 ON-EXCEPTION-TITLE       PIC X(60) VALUE
000178                        "Registration Report Error".
000179
000180 01 ON-EXCEPTION-STYLE       PIC S9(4) COMP-5.
000180 77 POW-0001 PIC S9(4) COMP-5 .
000180 77 POW-0002 PIC S9(4) COMP-5 .
000180 77 POW-0003 PIC X(256) .
000180 77 POW-0004 PIC X(256) .
000180 77 POW-0005 PIC X(256) .
000180 77 POW-0006 PIC X(256) .
000180 77 POW-0007 PIC X(256) .
000180 77 POW-0008 PIC X(256) .
000180 77 POW-0009 PIC X(256) .
000180 77 POW-0010 PIC X(256) .
000180 77 POW-0011 PIC X(256) .
000180 77 POW-0012 PIC X(60) .
000180 77 POW-0013 PIC S9(4) COMP-5 .
000181
000182
000183 PROCEDURE DIVISION.
000184
000185 A000-MAIN.
000186
000187* Check if error messages are still displayed and switch them off
000188     IF REG-ID-ST-ERROR-DISPLAYED
000189         MOVE  0  TO POW-0001
000189         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-S-ERR POW-0001 
000190         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000191     END-IF
000192     IF REG-ID-EN-ERROR-DISPLAYED
000193         MOVE  0  TO POW-0002
000193         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-E-ERR POW-0002 
000194         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000195     END-IF
000196
000197     SET RQ-REQUEST-OK TO TRUE
000198
000199* Check the report order to be used and set up the call parameters.
000200     EVALUATE TRUE 
000201
000202       WHEN RQ-FIRST-NAME
000203         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-FRSTNM-STRT  BY REFERENCE POW-0003 
000203         MOVE POW-0003
000204           TO RQ-START-NAME
000205         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-FRSTNM-END  BY REFERENCE POW-0004 
000205         MOVE POW-0004
000206           TO RQ-END-NAME
000207
000208*        Cross validate the input values
000209*         (Print program interprets spaces in end value to be
000210*           end-of-file)
000211         IF RQ-START-NAME > RQ-END-NAME
000212             AND
000213            RQ-END-NAME NOT = SPACE
000214           SET RQ-START-GREATER-THAN-END TO TRUE
000215           CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-FRSTNM-STRT 
000216         END-IF
000217
000218       WHEN RQ-LAST-NAME
000219         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-LASTNM-STRT  BY REFERENCE POW-0005 
000219         MOVE POW-0005
000220           TO RQ-START-NAME
000221         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-LASTNM-END  BY REFERENCE POW-0006 
000221         MOVE POW-0006
000222           TO RQ-END-NAME
000223
000224*        Cross validate the input values
000225*         (Print program interprets spaces in end value to be
000226*           end-of-file)
000227         IF RQ-START-NAME > RQ-END-NAME
000228             AND
000229            RQ-END-NAME NOT = SPACE
000230           SET RQ-START-GREATER-THAN-END TO TRUE
000231           CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-LASTNM-STRT 
000232         END-IF
000233
000234       WHEN RQ-REGISTRATION-ID
000235         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-REGID-STRT  BY REFERENCE POW-0007 
000235         MOVE POW-0007 TO WK-AREA
000236
000237*       Print program interprets spaces as meaning start-of-
000238*        file or end-of-file.
000239
000240         IF WK-AREA = SPACE
000241           MOVE SPACE TO RQ-START-REGISTRATION-IDX
000242         ELSE
000243           PERFORM R100-RIGHT-ALIGN
000244           MOVE WK-NUM TO RQ-START-REGISTRATION-ID
000245         END-IF
000246         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-REGID-END  BY REFERENCE POW-0008 
000246         MOVE POW-0008 TO WK-AREA
000247         IF WK-AREA = SPACE
000248           MOVE SPACE TO RQ-END-REGISTRATION-IDX
000249         ELSE
000250           PERFORM R100-RIGHT-ALIGN
000251           MOVE WK-NUM TO RQ-END-REGISTRATION-ID
000252         END-IF
000253
000254*        Cross validate the input values
000255*         (Print program interprets spaces in end value to be
000256*           end-of-file)
000257         IF RQ-START-REGISTRATION-ID > RQ-END-REGISTRATION-ID
000258             AND
000259            RQ-END-REGISTRATION-IDX NOT = SPACE
000260           SET RQ-START-GREATER-THAN-END TO TRUE
000261           CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-REGID-STRT 
000262         END-IF
000263
000264       WHEN RQ-SERIAL-NUMBER
000265         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-SERNO-STRT  BY REFERENCE POW-0009 
000265         MOVE POW-0009
000266           TO RQ-START-SERIAL-NO
000267         CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-SERNO-END  BY REFERENCE POW-0010 
000267         MOVE POW-0010
000268           TO RQ-END-SERIAL-NO
000269
000270*        Cross validate the input values
000271*         (Print program interprets spaces in end value to be
000272*           end-of-file)
000273         IF RQ-START-SERIAL-NO > RQ-END-SERIAL-NO
000274             AND
000275            RQ-END-SERIAL-NO NOT = SPACE
000276           SET RQ-START-GREATER-THAN-END TO TRUE
000277           CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-SERNO-STRT 
000278         END-IF
000279
000280     END-EVALUATE
000281
000282     IF RQ-REQUEST-OK
000283       CALL "Print-Registrations" USING REPORT-REQUEST
000284         ON EXCEPTION SET RQ-UNABLE-TO-CALL-PRINT-PROG TO TRUE
000285       END-CALL
000286     END-IF
000287
000288*  Check return code and display message
000289     IF NOT RQ-REQUEST-OK
000290       MOVE ERROR-MESSAGE (RQ-RETURN-CODE) TO MB-MESSAGE
000291       PERFORM M100-MESSAGE-DISPLAY
000292     END-IF
000293
000294     EXIT PROGRAM
000295     .
000296
000297  M100-MESSAGE-DISPLAY.
000298* Set up the message box style
000299     ADD 0
000300         48
000301         0
000302       GIVING ON-EXCEPTION-STYLE
000303     END-ADD
000304     MOVE  MB-MESSAGE  TO POW-0011
000304     MOVE  ON-EXCEPTION-TITLE  TO POW-0012
000304     MOVE  ON-EXCEPTION-STYLE  TO POW-0013
000304     CALL "XPOWCSMESSAGEBOX"  USING BY VALUE COBOLREG
000305              BY REFERENCE POW-0011 
000306             POW-0012 
000307              BY VALUE POW-0013 
000308     END-CALL
000309     .
000310
000311  R100-RIGHT-ALIGN.
000312* Find rightmost non-space character
000313* CHANGE event code ensures the characters are a continuous
000314*  left-aligned string of numeric digits
000315     PERFORM VARYING WK-POINTER 
000316                FROM CONST-REG-ID-LENGTH
000317                  BY -1
000318               UNTIL WK-AREA (WK-POINTER:1) NOT = SPACE
000319                  OR WK-POINTER = 1
000320     END-PERFORM
000321
000322* Use part of WK-AREA as a temporary store for right alignment
000323*  a) Move out of work area
000324     MOVE WK-AREA (1:WK-POINTER) 
000325       TO WK-AREA (CONST-REG-ID-LENGTH + 1:WK-POINTER)
000326*  b) Move back in right-aligned
000327     MOVE WK-AREA (CONST-REG-ID-LENGTH + 1:WK-POINTER) 
000328       TO WK-AREA (CONST-REG-ID-LENGTH + 1 - WK-POINTER:WK-POINTER)
000329
000330* Zero fill
000331     SUBTRACT WK-POINTER FROM CONST-REG-ID-LENGTH GIVING WK-POINTER
000332     PERFORM VARYING WK-POINTER-2
000333                FROM 1
000334                  BY 1
000335               UNTIL WK-POINTER-2 > WK-POINTER
000336       MOVE "0" TO WK-AREA (WK-POINTER-2:1)
000337     END-PERFORM
000338     .
000339   
000340  END PROGRAM "INVOKE-PRINT".
000341 IDENTIFICATION DIVISION.
000342 PROGRAM-ID. "COBOLREG-OPENED".
000343 ENVIRONMENT DIVISION.
000344 DATA        DIVISION.
000344 WORKING-STORAGE SECTION.
000345 PROCEDURE   DIVISION.
000346     SET RQ-LAST-NAME TO TRUE
000347     CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-LASTNM-STRT 
000348     EXIT PROGRAM
000349     .
000350 END PROGRAM "COBOLREG-OPENED".
000351 IDENTIFICATION DIVISION.
000352 PROGRAM-ID. "COBOLREG-START".
000353 PROCEDURE DIVISION.
000354     EXIT PROGRAM.
000355 END PROGRAM "COBOLREG-START".
000356 IDENTIFICATION DIVISION.
000357 PROGRAM-ID. "RADIO-FRSTNAM-CLICK".
000358 ENVIRONMENT DIVISION.
000359 DATA        DIVISION.
000359 WORKING-STORAGE SECTION.
000359 77 POW-0001 PIC S9(4) COMP-5 .
000359 77 POW-0002 PIC S9(4) COMP-5 .
000359 77 POW-0003 PIC S9(4) COMP-5 .
000359 77 POW-0004 PIC S9(4) COMP-5 .
000359 77 POW-0005 PIC S9(4) COMP-5 .
000359 77 POW-0006 PIC S9(4) COMP-5 .
000359 77 POW-0007 PIC S9(4) COMP-5 .
000359 77 POW-0008 PIC S9(4) COMP-5 .
000360 PROCEDURE   DIVISION.
000361
000362* NOTE: The code below makes it easier to use a mouse
000363*  than the keyboard as putting focus on the first
000364*  range field when the radio button is selected makes
000365*  it difficult to select the radio buttons using the
000366*  keyboard.
000367
000368* Enable the first name range edit fields
000369     MOVE  1  TO POW-0001
000369     MOVE  1  TO POW-0002
000369     CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-STRT POW-0001 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-END POW-0002 
000371
000372* Set the focus on the first range field.
000373     CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-FRSTNM-STRT 
000374
000375* Set the report order type
000376     SET RQ-FIRST-NAME TO TRUE
000377
000378* Disable the other active edit fields
000379     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-LASTNM-STRT 
000379     IF PROGRAM-STATUS = 1
000380         MOVE  0  TO POW-0003
000380         MOVE  0  TO POW-0004
000380         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-STRT POW-0003 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-END POW-0004 
000382     END-IF
000383     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-REGID-STRT 
000383     IF PROGRAM-STATUS = 1
000384         MOVE  0  TO POW-0005
000384         MOVE  0  TO POW-0006
000384         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-STRT POW-0005 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-END POW-0006 
000386     END-IF
000387     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-SERNO-STRT 
000387     IF PROGRAM-STATUS = 1
000388         MOVE  0  TO POW-0007
000388         MOVE  0  TO POW-0008
000388         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-STRT POW-0007 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-END POW-0008 
000390     END-IF
000391
000392 END PROGRAM "RADIO-FRSTNAM-CLICK".
000393 IDENTIFICATION DIVISION.
000394 PROGRAM-ID. "RADIO-LASTNAM-CLICK".
000395 ENVIRONMENT DIVISION.
000396 DATA        DIVISION.
000396 WORKING-STORAGE SECTION.
000396 77 POW-0001 PIC S9(4) COMP-5 .
000396 77 POW-0002 PIC S9(4) COMP-5 .
000396 77 POW-0003 PIC S9(4) COMP-5 .
000396 77 POW-0004 PIC S9(4) COMP-5 .
000396 77 POW-0005 PIC S9(4) COMP-5 .
000396 77 POW-0006 PIC S9(4) COMP-5 .
000396 77 POW-0007 PIC S9(4) COMP-5 .
000396 77 POW-0008 PIC S9(4) COMP-5 .
000397 PROCEDURE   DIVISION.
000398
000399* Enable the last name range edit fields
000400     MOVE  1  TO POW-0001
000400     MOVE  1  TO POW-0002
000400     CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-STRT POW-0001 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-END POW-0002 
000402
000403* Set the focus on the first range field.
000404     CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-LASTNM-STRT 
000405
000406* Set the report order type
000407     SET RQ-LAST-NAME TO TRUE
000408
000409* Disable the other active edit fields
000410     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-FRSTNM-STRT 
000410     IF PROGRAM-STATUS = 1
000411         MOVE  0  TO POW-0003
000411         MOVE  0  TO POW-0004
000411         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-STRT POW-0003 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-END POW-0004 
000413     END-IF
000414     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-REGID-STRT 
000414     IF PROGRAM-STATUS = 1
000415         MOVE  0  TO POW-0005
000415         MOVE  0  TO POW-0006
000415         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-STRT POW-0005 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-END POW-0006 
000417     END-IF
000418     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-SERNO-STRT 
000418     IF PROGRAM-STATUS = 1
000419         MOVE  0  TO POW-0007
000419         MOVE  0  TO POW-0008
000419         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-STRT POW-0007 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-END POW-0008 
000421     END-IF
000422 END PROGRAM "RADIO-LASTNAM-CLICK".
000423 IDENTIFICATION DIVISION.
000424 PROGRAM-ID. "RADIO-REGNO-CLICK".
000425 ENVIRONMENT DIVISION.
000426 DATA        DIVISION.
000426 WORKING-STORAGE SECTION.
000426 77 POW-0001 PIC S9(4) COMP-5 .
000426 77 POW-0002 PIC S9(4) COMP-5 .
000426 77 POW-0003 PIC S9(4) COMP-5 .
000426 77 POW-0004 PIC S9(4) COMP-5 .
000426 77 POW-0005 PIC S9(4) COMP-5 .
000426 77 POW-0006 PIC S9(4) COMP-5 .
000426 77 POW-0007 PIC S9(4) COMP-5 .
000426 77 POW-0008 PIC S9(4) COMP-5 .
000427 PROCEDURE   DIVISION.
000428
000429* Enable the registration number range edit fields
000430     MOVE  1  TO POW-0001
000430     MOVE  1  TO POW-0002
000430     CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-STRT POW-0001 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-END POW-0002 
000432
000433* Set the focus on the first range field.
000434     CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-REGID-STRT 
000435
000436* Set the report order type
000437     SET RQ-REGISTRATION-ID TO TRUE
000438
000439* Disable the other active edit fields
000440     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-FRSTNM-STRT 
000440     IF PROGRAM-STATUS = 1
000441         MOVE  0  TO POW-0003
000441         MOVE  0  TO POW-0004
000441         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-STRT POW-0003 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-END POW-0004 
000443     END-IF
000444     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-LASTNM-STRT 
000444     IF PROGRAM-STATUS = 1
000445         MOVE  0  TO POW-0005
000445         MOVE  0  TO POW-0006
000445         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-STRT POW-0005 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-END POW-0006 
000447     END-IF
000448     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-SERNO-STRT 
000448     IF PROGRAM-STATUS = 1
000449         MOVE  0  TO POW-0007
000449         MOVE  0  TO POW-0008
000449         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-STRT POW-0007 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-END POW-0008 
000451     END-IF
000452 END PROGRAM "RADIO-REGNO-CLICK".
000453 IDENTIFICATION DIVISION.
000454 PROGRAM-ID. "RADIO-SERNO-CLICK".
000455 ENVIRONMENT DIVISION.
000456 DATA        DIVISION.
000456 WORKING-STORAGE SECTION.
000456 77 POW-0001 PIC S9(4) COMP-5 .
000456 77 POW-0002 PIC S9(4) COMP-5 .
000456 77 POW-0003 PIC S9(4) COMP-5 .
000456 77 POW-0004 PIC S9(4) COMP-5 .
000456 77 POW-0005 PIC S9(4) COMP-5 .
000456 77 POW-0006 PIC S9(4) COMP-5 .
000456 77 POW-0007 PIC S9(4) COMP-5 .
000456 77 POW-0008 PIC S9(4) COMP-5 .
000457 PROCEDURE   DIVISION.
000458
000459* Enable the serial number range edit fields
000460     MOVE  1  TO POW-0001
000460     MOVE  1  TO POW-0002
000460     CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-STRT POW-0001 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-SERNO-END POW-0002 
000462
000463* Set the focus on the first range field.
000464     CALL "XPOWCWSETFOCUS"  USING BY VALUE ED-SERNO-STRT 
000465
000466* Set the report order type
000467     SET RQ-SERIAL-NUMBER TO TRUE
000468
000469* Disable the other active edit fields
000470     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-LASTNM-STRT 
000470     IF PROGRAM-STATUS = 1
000471         MOVE  0  TO POW-0003
000471         MOVE  0  TO POW-0004
000471         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-STRT POW-0003 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-LASTNM-END POW-0004 
000473     END-IF
000474     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-REGID-STRT 
000474     IF PROGRAM-STATUS = 1
000475         MOVE  0  TO POW-0005
000475         MOVE  0  TO POW-0006
000475         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-STRT POW-0005 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-REGID-END POW-0006 
000477     END-IF
000478     CALL  "XPOWCWGETENABLE"  USING BY VALUE ED-FRSTNM-STRT 
000478     IF PROGRAM-STATUS = 1
000479         MOVE  0  TO POW-0007
000479         MOVE  0  TO POW-0008
000479         CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-STRT POW-0007 CALL  "XPOWCWSETENABLE"  USING BY VALUE ED-FRSTNM-END POW-0008 
000481     END-IF
000482 END PROGRAM "RADIO-SERNO-CLICK".
000483 IDENTIFICATION DIVISION.
000484 PROGRAM-ID. "BUTTON-CANCEL-CLICK".
000485 ENVIRONMENT DIVISION.
000486 DATA        DIVISION.
000486 WORKING-STORAGE SECTION.
000487 PROCEDURE   DIVISION.
000488
000489     CALL "XPOWCSCLOSEMYSELF"  USING BY VALUE COBOLREG 
000490     EXIT PROGRAM
000491     .
000492 END PROGRAM "BUTTON-CANCEL-CLICK".
000493 IDENTIFICATION DIVISION.
000494 PROGRAM-ID. "BUTTON-PRINT-CLICK".
000495 ENVIRONMENT DIVISION.
000496 DATA        DIVISION.
000497 PROCEDURE   DIVISION.
000498
000499     CALL CONST-INVOKE-PRINT-PROG
000500     EXIT PROGRAM
000501     .
000502
000503 END PROGRAM "BUTTON-PRINT-CLICK".
000504 IDENTIFICATION DIVISION.
000505 PROGRAM-ID. "ED-FRSTNM-STRT-CHANGE".
000506 ENVIRONMENT DIVISION.
000507 DATA        DIVISION.
000508 PROCEDURE   DIVISION.
000509         
000510     
000511 END PROGRAM "ED-FRSTNM-STRT-CHANGE".
000512 IDENTIFICATION DIVISION.
000513 PROGRAM-ID. "ED-FRSTNM-STRT-RETURN".
000514 ENVIRONMENT DIVISION.
000515 DATA        DIVISION.
000516 PROCEDURE   DIVISION.
000517
000518     CALL CONST-INVOKE-PRINT-PROG
000519     EXIT PROGRAM
000520     .
000521 END PROGRAM "ED-FRSTNM-STRT-RETURN".
000522 IDENTIFICATION DIVISION.
000523 PROGRAM-ID. "ED-FRSTNM-END-RETURN".
000524 ENVIRONMENT DIVISION.
000525 DATA        DIVISION.
000526 PROCEDURE   DIVISION.
000527
000528     CALL CONST-INVOKE-PRINT-PROG
000529     EXIT PROGRAM
000530     .
000531 END PROGRAM "ED-FRSTNM-END-RETURN".
000532 IDENTIFICATION DIVISION.
000533 PROGRAM-ID. "ED-LASTNM-STRT-RETURN".
000534 ENVIRONMENT DIVISION.
000535 DATA        DIVISION.
000536 PROCEDURE   DIVISION.
000537
000538     CALL CONST-INVOKE-PRINT-PROG
000539     EXIT PROGRAM
000540     .
000541 END PROGRAM "ED-LASTNM-STRT-RETURN".
000542 IDENTIFICATION DIVISION.
000543 PROGRAM-ID. "ED-LASTNM-END-RETURN".
000544 ENVIRONMENT DIVISION.
000545 DATA        DIVISION.
000546 PROCEDURE   DIVISION.
000547
000548     CALL CONST-INVOKE-PRINT-PROG
000549     EXIT PROGRAM
000550     .
000551 END PROGRAM "ED-LASTNM-END-RETURN".
000552 IDENTIFICATION DIVISION.
000553 PROGRAM-ID. "ED-REGID-STRT-CHANGE".
000554 ENVIRONMENT DIVISION.
000555 DATA        DIVISION.
000556 WORKING-STORAGE SECTION.
000557 01  WK-AREA                 PIC X(256).
000558 01  STORE-AREA              PIC X(9).
000559 01  WK-POINTER              PIC 9(4) COMP.
000560 01  CALL-COUNT              PIC 99.
000560 77 POW-0001 PIC S9(4) COMP-5 .
000560 77 POW-0002 PIC X(256) .
000560 77 POW-0003 PIC S9(4) COMP-5 .
000560 77 POW-0004 PIC S9(4) COMP-5 .
000560 77 POW-0005 PIC X(256) .
000561
000562 PROCEDURE   DIVISION.
000563
000564 A000-MAIN.
000565
000566* Check for error message and hide it
000567     IF REG-ID-ST-ERROR-DISPLAYED
000568       ADD 1 TO CALL-COUNT
000569
000570*      When POW-TEXT is updated another call to this 
000571*      event is generated so wait for second change 
000572*      event to hide message
000573       IF CALL-COUNT > 1
000574         MOVE  0  TO POW-0001
000574         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-S-ERR POW-0001 
000575         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000576
000577       END-IF
000578     END-IF
000579
000580* Use WK-AREA to manipulate the input string
000581     CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-REGID-STRT  BY REFERENCE POW-0002 
000581     MOVE POW-0002 TO WK-AREA
000582     MOVE 1 TO WK-POINTER
000583
000584* Check data is numeric
000585     PERFORM B100-CHECK-NUMERIC
000586         UNTIL REG-ID-ST-NON-NUMERIC
000587            OR WK-POINTER > CONST-REG-ID-LENGTH
000588     IF REG-ID-ST-NON-NUMERIC
000589
000590*        Display a "tooltip" style error warning
000591         MOVE  1  TO POW-0003
000591         CALL  "XPOWCWSETENABLE"  USING BY VALUE TX-RGID-S-ERR POW-0003 
000592         MOVE  1  TO POW-0004
000592         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-S-ERR POW-0004 
000593         SET REG-ID-ST-ERROR-DISPLAYED TO TRUE
000594         MOVE 0 TO CALL-COUNT
000595
000596*        Restore the number to the previous good value
000597         MOVE STORE-AREA TO WK-AREA(1:CONST-REG-ID-LENGTH)
000598         MOVE  WK-AREA  TO POW-0005
000598         CALL  "XPOWEDITSETTEXT"  USING BY VALUE ED-REGID-STRT  BY REFERENCE POW-0005 
000599
000600*        NOTE: The above move to POW-TEXT generates another 
000601*          call to this procedure.  Only update POW-TEXT in
000602*          a CHANGE event within a conditional piece of code,
000603*          otherwise an infinite loop results.
000604
000605     ELSE
000606
000607*        Store a good value
000608         MOVE WK-AREA (1:CONST-REG-ID-LENGTH) TO STORE-AREA
000609
000610     END-IF
000611
000612     EXIT PROGRAM
000613     .
000614 
000615 B100-CHECK-NUMERIC.
000616
000617*  Note - need to allow for field being all spaces, or space filled
000618*         so first comparison accepts spaces.
000619     IF  (WK-AREA (WK-POINTER:1) < CONST-ASCII-ZERO
000620             AND
000621          WK-AREA (WK-POINTER:1) NOT = SPACE)
000622             OR
000623          WK-AREA (WK-POINTER:1) > CONST-ASCII-NINE
000624         SET REG-ID-ST-NON-NUMERIC TO TRUE
000625     END-IF
000626
000627* Check for spaces embedded between numbers
000628     IF WK-AREA (WK-POINTER:1) = SPACE
000629         AND
000630        WK-AREA (WK-POINTER + 1:1) NOT = SPACE
000631         SET REG-ID-ST-NON-NUMERIC TO TRUE
000632     END-IF
000633     ADD 1 TO WK-POINTER
000634     .
000635
000636 END PROGRAM "ED-REGID-STRT-CHANGE".
000637 IDENTIFICATION DIVISION.
000638 PROGRAM-ID. "ED-REGID-STRT-EDIT".
000639 ENVIRONMENT DIVISION.
000640 DATA        DIVISION.
000640 WORKING-STORAGE SECTION.
000640 77 POW-0001 PIC S9(4) COMP-5 .
000641 PROCEDURE   DIVISION.
000642
000643* Note: This event is only invoked if it is checked in the object's
000644*  STYLE, EVENT dialog box.
000645
000646     IF REG-ID-EN-ERROR-DISPLAYED
000647         MOVE  0  TO POW-0001
000647         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-E-ERR POW-0001 
000648         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000649     END-IF
000650     EXIT PROGRAM
000651     .
000652 END PROGRAM "ED-REGID-STRT-EDIT".
000653 IDENTIFICATION DIVISION.
000654 PROGRAM-ID. "ED-REGID-STRT-RETURN".
000655 ENVIRONMENT DIVISION.
000656 DATA        DIVISION.
000657 PROCEDURE   DIVISION.
000658
000659     CALL CONST-INVOKE-PRINT-PROG
000660     EXIT PROGRAM
000661     .
000662 END PROGRAM "ED-REGID-STRT-RETURN".
000663 IDENTIFICATION DIVISION.
000664 PROGRAM-ID. "ED-REGID-END-CHANGE".
000665 ENVIRONMENT DIVISION.
000666 DATA        DIVISION.
000667 WORKING-STORAGE SECTION.
000668 01  WK-AREA                 PIC X(256).
000669 01  STORE-AREA              PIC X(9).
000670 01  WK-POINTER              PIC 9(4) COMP.
000671 01  CALL-COUNT              PIC 99.
000671 77 POW-0001 PIC S9(4) COMP-5 .
000671 77 POW-0002 PIC X(256) .
000671 77 POW-0003 PIC S9(4) COMP-5 .
000671 77 POW-0004 PIC S9(4) COMP-5 .
000671 77 POW-0005 PIC X(256) .
000672
000673 PROCEDURE   DIVISION.
000674
000675 A000-MAIN.
000676
000677* Check for error message and hide it
000678     IF REG-ID-EN-ERROR-DISPLAYED
000679       ADD 1 TO CALL-COUNT
000680
000681*      When POW-TEXT is updated another call to this 
000682*      event is generated so wait for second change 
000683*      event to hide message
000684       IF CALL-COUNT > 1
000685         MOVE  0  TO POW-0001
000685         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-E-ERR POW-0001 
000686         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000687
000688       END-IF
000689     END-IF
000690
000691* Use WK-AREA to manipulate the input string
000692     CALL  "XPOWEDITGETTEXT"  USING BY VALUE ED-REGID-END  BY REFERENCE POW-0002 
000692     MOVE POW-0002 TO WK-AREA
000693     MOVE 1 TO WK-POINTER
000694
000695* Check data is numeric
000696     PERFORM B100-CHECK-NUMERIC
000697         UNTIL REG-ID-EN-NON-NUMERIC
000698            OR WK-POINTER > CONST-REG-ID-LENGTH
000699     IF REG-ID-EN-NON-NUMERIC
000700
000701*        Display a "tooltip" style error warning
000702         MOVE  1  TO POW-0003
000702         CALL  "XPOWCWSETENABLE"  USING BY VALUE TX-RGID-E-ERR POW-0003 
000703         MOVE  1  TO POW-0004
000703         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-E-ERR POW-0004 
000704         SET REG-ID-EN-ERROR-DISPLAYED TO TRUE
000705         MOVE 0 TO CALL-COUNT
000706
000707*        Restore the number to the previous good value
000708         MOVE STORE-AREA TO WK-AREA(1:CONST-REG-ID-LENGTH)
000709         MOVE  WK-AREA  TO POW-0005
000709         CALL  "XPOWEDITSETTEXT"  USING BY VALUE ED-REGID-END  BY REFERENCE POW-0005 
000710*        NOTE: The above move to POW-TEXT generates another 
000711*          call to this procedure.  Only update POW-TEXT in
000712*          a CHANGE event within a conditional piece of code,
000713*          otherwise an infinite loop results.
000714
000715     ELSE
000716
000717*        Store a good value
000718         MOVE WK-AREA (1:CONST-REG-ID-LENGTH) TO STORE-AREA
000719
000720     END-IF
000721
000722     EXIT PROGRAM
000723     .
000724 
000725 B100-CHECK-NUMERIC.
000726
000727*  Note - need to allow for field being all spaces, or space filled
000728*         so first comparison accepts spaces.
000729     IF  (WK-AREA (WK-POINTER:1) < CONST-ASCII-ZERO
000730             AND
000731          WK-AREA (WK-POINTER:1) NOT = SPACE)
000732             OR
000733          WK-AREA (WK-POINTER:1) > CONST-ASCII-NINE
000734         SET REG-ID-EN-NON-NUMERIC TO TRUE
000735     END-IF
000736
000737* Check for spaces embedded between numbers
000738     IF WK-AREA (WK-POINTER:1) = SPACE
000739         AND
000740        WK-AREA (WK-POINTER + 1:1) NOT = SPACE
000741         SET REG-ID-EN-NON-NUMERIC TO TRUE
000742     END-IF
000743     ADD 1 TO WK-POINTER
000744     .
000745
000746 END PROGRAM "ED-REGID-END-CHANGE".
000747 IDENTIFICATION DIVISION.
000748 PROGRAM-ID. "ED-REGID-END-EDIT".
000749 ENVIRONMENT DIVISION.
000750 DATA        DIVISION.
000750 WORKING-STORAGE SECTION.
000750 77 POW-0001 PIC S9(4) COMP-5 .
000751 PROCEDURE   DIVISION.
000752
000753* Note: This event is only invoked if it is checked in the object's
000754*  STYLE, EVENT dialog box.
000755
000756     IF REG-ID-ST-ERROR-DISPLAYED
000757         MOVE  0  TO POW-0001
000757         CALL  "XPOWCWSETVISIBLE"  USING BY VALUE TX-RGID-S-ERR POW-0001 
000758         SET REG-ID-NO-ERROR-DISPLAYED TO TRUE
000759     END-IF
000760     EXIT PROGRAM
000761     .
000762 END PROGRAM "ED-REGID-END-EDIT".
000763 IDENTIFICATION DIVISION.
000764 PROGRAM-ID. "ED-REGID-END-RETURN".
000765 ENVIRONMENT DIVISION.
000766 DATA        DIVISION.
000767 PROCEDURE   DIVISION.
000768
000769     CALL CONST-INVOKE-PRINT-PROG
000770     EXIT PROGRAM
000771     .
000772 END PROGRAM "ED-REGID-END-RETURN".
000773 IDENTIFICATION DIVISION.
000774 PROGRAM-ID. "ED-SERNO-STRT-RETURN".
000775 ENVIRONMENT DIVISION.
000776 DATA        DIVISION.
000777 PROCEDURE   DIVISION.
000778
000779     CALL CONST-INVOKE-PRINT-PROG
000780     EXIT PROGRAM
000781     .
000782 END PROGRAM "ED-SERNO-STRT-RETURN".
000783 IDENTIFICATION DIVISION.
000784 PROGRAM-ID. "ED-SERNO-END-RETURN".
000785 ENVIRONMENT DIVISION.
000786 DATA        DIVISION.
000787 PROCEDURE   DIVISION.
000788
000789     CALL CONST-INVOKE-PRINT-PROG
000790     EXIT PROGRAM
000791     .
000792 END PROGRAM "ED-SERNO-END-RETURN".
000793 IDENTIFICATION DIVISION.
000794 PROGRAM-ID. "DEMO-DESCRIP-CLICK".
000795 ENVIRONMENT DIVISION.
000796 DATA        DIVISION.
000797 PROCEDURE   DIVISION.
000798
000799* The COBOL-Registrations demo program shows how to take 
000800*  advantage of PowerFORM working with PowerCOBOL.  It is 
000801*  a full application taking data from a file of (COBOL) 
000802*  customer registrations and printing specified ranges 
000803*  of data, along with a summary report.
000804*
000805* There are two parts to the demo:
000806*
000807*  1. COBOL-REGISTRATIONS.WIN
000808*    The PowerCOBOL sheet. This accepts the desired range 
000809*    from the user and invokes the print program.
000810*    See below for a description of features.
000811*
000812*  2. PRINT-REGISTRATIONS.COB
000813*    The print program.  It reads the data from the 
000814*    COBOL-Registrations file and prints it out using the 
000815*    PRINTREG PowerFORM descriptor.
000816*    It is a COBOL85 program, written using the Programming 
000817*    STAFF editor but compiled as part of the PowerCOBOL
000818*    project.
000819*    See the source for more information about the techniques 
000820*    it demonstrates.
000821*
000822*
000823* TECHNIQUES DEMONSTRATED IN COBOL-REGISTRATIONS.WIN:
000824*
000825*    - Use of a COMMON sub-program to service the same function
000826*      from many different events.
000827*         (See the INVOKE-PRINT program in the sheet's 
000828*          PROCEDURE code)
000829*    - Enabling and disabling edit items according to radio
000830*      button selection.
000831*         (See the CLICK code for the radio button items)
000832*    - Accepting only numeric input to an edit item.  
000833*         (See the CHANGE code for the REGISTRATION ID range
000834*          edit fields)
000835*    - Right aligning numeric field input
000836*         (See the INVOKE-PRINT program in the sheet's 
000837*          PROCEDURE code)
000838*    - Displaying a "tooltip" style error message.
000839*         (See the CHANGE event and the EDIT event code for 
000840*          the REGISTRATION ID range edit items)
000841*    - Verifying data across fields.
000842*         (See the INVOKE-PRINT program in the sheet's 
000843*          PROCEDURE code)
000844*    - Invoking the default action (Print) on a click of the
000845*      button or the Return key.
000846*         (See the RETURN events for all the range edit items)
000847*    - Limiting the length of an edit item.
000848*         (See the ExStyle dialog box from the Style dialog box
000849*          for any of the range edit items)
000850*    - Using a Message Box to display error messages.
000851*         (See the INVOKE-PRINT program in the sheet's 
000852*          PROCEDURE code)
000853*    - Using GLOBAL data to be accessible to all event code.
000854*         (See the sheet's WORKING-STORAGE code)
000855*
000856*
000857*    NOTES ON USING COBOL-REGISTRATIONS.WIN
000858*
000859*    When you compile the sheet some errors are displayed:
000860*
000861*      - Certain data items are "NOT FOUND, UNDEFINED OR
000862*        DEFINED IN A COPY STATEMENT".  This is because
000863*        the PowerCOBOL preprocessor does not look in the 
000864*        Registration-Record.CBL file.  The errors are
000865*        informational and do not affect the compiled code.
000866*
000867*      - An in-line PERFORM statement in the sheet procedure
000868*        code doesn't contain a statement.  It uses the UNTIL
000869*        clause to position a pointer and works as expected.
000870*        The error is informational.
000871* 
000872*    Coding conventions:
000873* 
000874*      - Common data items used, or likely to be used by 
000875*        several procedures, are defined in the sheet's
000876*        WORKING and CONSTANT code areas. 
000877*        All items in the CONSTANT code area are prefixed 
000878*        with the string "CONST-".  
000879*        There are only two records in the WORKING code area
000880*        and, as one of these is shared with the print program,
000881*        they are not prefixed with a WORKING prefix. They have
000882*        the prefixes "RQ-" (for Report Request) and "REG-ID-"
000883*        (for Registration ID statuses).
000884*
000885*      - The prefix "WK-" is used for local work areas whose
000886*        contents are expected to change on each invocation of
000887*        a procedure.
000888
000889 END PROGRAM "DEMO-DESCRIP-CLICK".
000890 END PROGRAM "COBOLREG".
