000010* Constants used in the COBOL-Registrations and 
000020*  Print-Registrations demo programs
000030
000040 01 CONST-REG-ID-LENGTH	   GLOBAL  PIC 99 VALUE 9.
000050 01 CONST-INVOKE-PRINT-PROG  GLOBAL  PIC X(30) 
000060							   VALUE "INVOKE-PRINT".
000070 01 CONST-ASCII-ZERO         GLOBAL  PIC X VALUE X"30".
000090 01 CONST-ASCII-NINE         GLOBAL  PIC X VALUE X"39".
