000010 01 Registration-record.
000020	 03 RF-REG-ID	               PIC S9(9)  COMP-5.
000021   03 RF-REG-IDX REDEFINES RF-REG-ID 
000022                                 PIC X(4).
000030	 03 RF-REG-DATE                PIC X(8).
000040	 03 RF-FIRST-NAME              PIC X(35).
000050	 03 RF-MI                      PIC X(2).
000060	 03 RF-LAST-NAME               PIC X(35).
000070	 03 RF-EMAIL                   PIC X(128).
000080	 03 RF-COMPANY                 PIC X(50).
000090	 03 RF-JOB-TITLE               PIC X(40).
000100	 03 RF-ADDRESS1                PIC X(60).
000110	 03 RF-ADDRESS2                PIC X(60).
000120	 03 RF-CITY                    PIC X(30).
000130	 03 RF-STATE                   PIC X(2).
000140	 03 RF-ZIP                     PIC X(10).
000150	 03 RF-COUNTRY                 PIC X(30).
000160	 03 RF-AREA-CODE               PIC X(3).
000170	 03 RF-PHONE                   PIC X(10).
000180	 03 RF-EXTENSION               PIC X(15).
000190	 03 RF-FAX                     PIC X(40).
000200	 03 RF-SERIAL-NO               PIC X(30).
000210	 03 RF-PRIMARY-OS              PIC 9(1).
000221     88 RF-POS-WIN31           VALUE 1.
000223     88 RF-POS-WINNT35         VALUE 2.
000225     88 RF-POS-WINNT4X         VALUE 3.
000227     88 RF-POS-WIN95           VALUE 4.
000229     88 RF-POS-SOL2X           VALUE 5.
000231     88 RF-POS-HP9X            VALUE 6.
000233     88 RF-POS-HP10X           VALUE 7.
000235     88 RF-POS-MVS             VALUE 8.
000237     88 RF-POS-OTHER           VALUE 9.
000238	 03 RF-SECONDARY-OS            PIC 9(1).
000240     88 RF-SOS-WIN31           VALUE 1.
000242     88 RF-SOS-WINNT35         VALUE 2.
000244     88 RF-SOS-WINNT4X         VALUE 3.
000246     88 RF-SOS-WIN95           VALUE 4.
000248     88 RF-SOS-SOL2X           VALUE 5.
000250     88 RF-SOS-HP9X            VALUE 6.
000252     88 RF-SOS-HP10X           VALUE 7.
000254     88 RF-SOS-MVS             VALUE 8.
000256     88 RF-SOS-OTHER           VALUE 9.
000257	 03 RF-NO-PROG-GUI             PIC 9(1).
000259     88 RF-GUI-100G            VALUE 1.
000261     88 RF-GUI-100L            VALUE 2.
000263     88 RF-GUI-25L             VALUE 3.
000265     88 RF-GUI-5L              VALUE 4.
000267     88 RF-GUI-NONE            VALUE 5.
000268	 03 RF-NO-PROG-COBOL           PIC 9(1).
000270     88 RF-COBOL-100G          VALUE 1.
000272     88 RF-COBOL-100L          VALUE 2.
000274     88 RF-COBOL-25L           VALUE 3.
000276     88 RF-COBOL-5L            VALUE 4.
000278     88 RF-COBOL-NONE          VALUE 5.
000279	 03 RF-LOOK-REASON             PIC 9(1).
000281     88 RF-LOOK-ONGOING        VALUE 1.
000283     88 RF-LOOK-SPECIFIC       VALUE 2.
000285     88 RF-LOOK-FUTURE         VALUE 3.
000287     88 RF-LOOK-GENERAL        VALUE 4.
000289     88 RF-LOOK-OTHER          VALUE 5.
000290	 03 RF-REVIEW-REASON           PIC 9(1).
000292     88 RF-REVIEW-CS           VALUE 1.
000294     88 RF-REVIEW-SERVER       VALUE 2.
000296     88 RF-REVIEW-MF           VALUE 3.
000298     88 RF-REVIEW-PC           VALUE 4.
000300     88 RF-REVIEW-REHOST       VALUE 5.
000302     88 RF-REVIEW-OTHER        VALUE 6.
000303	 03 RF-WHO-DECIDES             PIC 9(1).
000304     88 RF-DECIDE-YOU          VALUE 1.
000305     88 RF-DECIDE-TEAM-LEADER  VALUE 2.
000306     88 RF-DECIDE-MIS-MANAGER  VALUE 3.
000307     88 RF-DECIDE-END-USER     VALUE 4.
000308     88 RF-DECIDE-SYS-INT      VALUE 5.
000309     88 RF-DECIDE-ACCOUNTING   VALUE 6.
000310     88 RF-DECIDE-OTHER        VALUE 7.
000311	 03 RF-JOB-FUNCTION            PIC 9(1).
000312     88 RF-JOB-APP-DEV         VALUE 1.
000313     88 RF-JOB-MANAGEMENT      VALUE 2.
000314	   88 RF-JOB-CONSULTING      VALUE 3.
000315     88 RF-JOB-COMP-OPS        VALUE 4.
000316     88 RF-JOB-SYS-INT         VALUE 5.
000317     88 RF-JOB-ACCOUNTING      VALUE 6.
000318     88 RF-JOB-OTHER           VALUE 7.
000319	 03 RF-DATABASES               PIC X(128).
000320	 03 RF-SERVER-SYS              PIC X(128).
000321	 03 RF-FRIEND                  PIC X(1).
000322	 03 RF-RELIABILITY             PIC X(1).
000330	 03 RF-SALESMAN                PIC X(1).
000340	 03 RF-PERFORMANCE             PIC X(1).
000350	 03 RF-PLATFORMS               PIC X(1).
000360	 03 RF-FEATURES                PIC X(1).
000370	 03 RF-GOOD-REVIEW             PIC X(1).
000380	 03 RF-DONT-KNOW               PIC X(1).
000390	 03 RF-ADVERTISEMENT           PIC X(1).
000400	 03 RF-PRICE                   PIC X(1).
000410	 03 RF-BUY-OTHER               PIC X(128).
000420
