000010* Record definition for interface between PowerCOBOL 
000011*  user interface program and COBOL85 print program.
000012* Starts at 03 so that record can be declared as
000013*  GLOBAL in PowerCOBOL sheet WORKING code
000021    03  RQ-REPORT-ORDER		   PIC 9.
000030	  88  RQ-FIRST-NAME      			VALUE 1.
000040    88  RQ-LAST-NAME       			VALUE 2.
000050    88  RQ-REGISTRATION-ID 			VALUE 3.
000060    88  RQ-SERIAL-NUMBER   			VALUE 4.
000070    03  RQ-START-NAME            PIC X(35).
000080    03  RQ-END-NAME              PIC X(35).
000090    03  RQ-START-REGISTRATION-ID PIC S9(9) COMP-5.
000091	  03  RQ-START-REGISTRATION-IDX REDEFINES RQ-START-REGISTRATION-ID
000092								   PIC X(4).
000100    03  RQ-END-REGISTRATION-ID   PIC S9(9) COMP-5.
000110	  03  RQ-END-REGISTRATION-IDX REDEFINES RQ-END-REGISTRATION-ID
000111								   PIC X(4).
000113    03  RQ-START-SERIAL-NO       PIC X(30).
000120    03  RQ-END-SERIAL-NO         PIC X(30).
000130    03  RQ-RETURN-CODE           PIC 99.
000140    88  RQ-REQUEST-OK               	VALUE 0.
000141    88  RQ-NO-ERROR					VALUE 0.
000150    88  RQ-INVALID-KEY 			   	VALUE 1.
000160    88  RQ-INVALID-REQUEST-CODE 	   	VALUE 2.
000170    88  RQ-END-BEFORE-FIRST-VALUE   	VALUE 3.
000171	  88  RQ-NO-RECORDS-IN-RANGE	   	VALUE 4.
000172    88  RQ-FAILED-TO-OPEN-REG-FILE  	VALUE 5.
000173	  88  RQ-UNABLE-TO-CALL-PRINT-PROG	VALUE 6.
000180    88  RQ-START-GREATER-THAN-END		VALUE 7.
